[
  {
    "displayName": "Peter Behrman de Sinéty",
    "alphaName": "behrman-de-sinety",
    "titlePrograms": [
      "Faculty, ESL and Writing Tutor"
    ],
    "image": "/uploadedImages/Parsons_Paris/Faculty/Peter-Behrman-de-Sinety-300.jpg",
    "continuingEd": false,
    "noDetail": false,
    "description": "<p>Peter Behrman de Sinéty is a writer, translator and lecturer at the Ecole Normale Supérieure, Paris. Born in Maine, Peter studied English literature at Yale University (B.A.) and Paris-Sorbonne University (M.A.). Since 2011, he has taught courses in twentieth-century British and American poetry, American film, creative writing, and academic writing at the ENS. His translations include texts by Julia Kristeva, Alejandro Jodorowsky, and Hans Ulrich Obrist, among others. As the executor of the estate of the photographer Madeleine de Sinéty, he is currently working on a retrospective exhibition and photography book with the Musée Nicéphore Niépce and Éditions Xavier Barral. </p>",
    "links": ""
  },
  {
    "displayName": "Francesca Bonesio",
    "alphaName": "bonesio",
    "titlePrograms": [
      "Faculty, First Year"
    ],
    "image": "/uploadedImages/Parsons_Paris/Faculty/Francesa_Bonesio.jpg",
    "continuingEd": false,
    "noDetail": false,
    "description": "<p>Francesca Bonesio is an Italian architect and artist based in Paris. Working on the frontier between art and architecture, she co-founded Atelier 37.2 in 2009 with Nicolas Guiraud, with whom she develops micro-architectural projects, inhabited sculptures, installations, and land art. With their latest piece, <i>The Whitewalkers</i>, they embarked on a 15,000-kilometer odyssey across Europe, driving their sculptures across dozens of borders, creating 120 installations in more than 20 countries, and drawing an alternative map of Europe’s frontiers.</p><p>Bonesio's works are featured regularly in the international art and architecture press and have been exhibited by art institutions, festivals, and private collections throughout Europe. She studied in Belgium, the United States, and Italy, where she obtained her PhD in Architecture from Politecnico of Turin. She lectures and teaches in a number of French art schools.</p>",
    "links": [
      {
        "label": "37-2.com",
        "url": "https://www.37-2.com"
      },
      {
        "label": "37-2.com/works/18/the-whitewalkers",
        "url": "http://www.37-2.com/works/18/the-whitewalkers"
      }
    ]
  },
  {
    "displayName": "Justine Bossard",
    "alphaName": "bossard",
    "titlePrograms": [
      "Faculty, Fashion Design"
    ],
    "image": "/uploadedImages/Parsons_Paris/Faculty/Bossard_Justine.jpg",
    "noDetail": false,
    "description": "<p>Justine Bossard is a pattern maker and fashion designer. Trained at La Chambre Syndicale de la Couture, she started her career as a costume designer for young theater companies, and for the Festival d’Avignon.</p><p>She worked for Paris based Couture designers such as Viktor & Rolf, Franck Sorbier and more recently, Jacquemus. Following a zero-waste philosophy, she launched an accessory brand based on the creative use of leather scraps.</p>",
    "links": ""
  },
  {
    "displayName": "Valerie Brun-Fraisse",
    "alphaName": "brun-fraisse",
    "titlePrograms": [
      "Faculty, French"
    ],
    "image": "/uploadedImages/Parsons_Paris/Faculty/Valerie-Brun-Fraisse.jpg",
    "noDetail": false,
    "description": "<p>Valérie Brun-Fraisse holds a Master’s degree in Didactiques du Français et des Langues from Paris III Sorbonne Nouvelle and has researched on mediation and creativity in learning a foreign language. She has taught French at The New School in New York, at the UN, and in Paris at ILCF. She also holds a MFA in Film from Columbia University and has produced and directed short films. She has taught courses in French cinema history and film analysis. She also received a Master’s degree in Philosophy from Paris I Sorbonne.</p>",
    "links": ""
  },
  {
    "displayName": "Antoine Bucher",
    "alphaName": "bucher",
    "titlePrograms": [
      "Faculty, Fashion Studies"
    ],
    "image": "/uploadedImages/Parsons_Paris/Faculty/Bucher_Anthoine.jpg",
    "noDetail": false,
    "description": "<p>Antoine Bucher graduated from the University of Lille and from the Institut d’Etudes Politiques de Paris where he grew an interest in a multifaceted approach of fashion including history, sociology, economics, literature and art history. In 2005, he founded Diktats with Nicolas Montagne. a bookstore specialized in rare books and documents related to fashion from the 16th century to the 20th century. As the manager of Diktats, Antoine Bucher has been working with international museums and libraries, private collectors and heritage departments of luxury brands for more than a decade. Antoine Bucher and Nicolas Montagne have published three thematic Diktats catalogues: Paul Poiret (2006), Sous la coupe des femmes, the great ladies of fashion, from Rose Bertin to Rei Kawakubo (2013), Under Pressure, three centuries of French fashion engravings (2018).</p><p>Antoine Bucher’s research addresses a wide range of subjects related to the history of fashion focusing on written and visual sources.</p>",
    "links": [
      {
        "label": "www.diktats.com",
        "url": "http://www.diktats.com"
      }
    ]
  },
  {
    "displayName": "Maggie Cardelius",
    "alphaName": "cardelius",
    "titlePrograms": [
      "Faculty, Art, Media & Technology"
    ],
    "image": "/uploadedImages/Parsons_Paris/Faculty/Cardelus_Maggie__300x300.jpg",
    "continuingEd": false,
    "noDetail": false,
    "description": "<p>Maggie Cardelús is an American/Spanish artist and designer working in Paris. Her work, comprised of wall pieces, sculpture, installations, video, and performance relies heavily on meticulous handcraft together with new media to push the limits of photography as both a hybrid image/object and as a social/psychological relational &quot;third space&quot; within communities.  She shows internationally and her work is in the collections of numerous public and private collections. Her reference galleries are Kaufmann Repetto in Milano and Galeria B2 in Madrid.  Cardelús also works periodically by invitation with fashion and design firms, her most recent design project being a collaboration with Julie de Libran for Sonia Rykiel's 2018 Atelier collection.</p><p>Cardelús holds a BA in studio art and art history from Wellesley College (1985), a Masters in Architecture from the Columbia University Graduate School of Architecture, Planning, and Preservation (1988), and a Master of Fine Arts from Hunter College in NY (1992). Her engagement with the history of photography and memory has led to a number of invitations, including Keynote Speaker at the Pavia University Self Media Lab (2017), lecturer at the University of Modena Giornate di Studio (2011), and lecturer at the Gradisca International Film Studies Spring School (2009).  Cardelús is recipient of numerous grants with which she has explored her interest in traditional crafts (Indian darning and embroidery, Indian traditional shadow puppetry, traditional batik, woodworking, leathercraft) through residencies in Japan, Malaysia, India, and South Africa. She taught at the Accademia di Belle Arti di Santagiulia (2008-2012) in Brescia before moving to Paris in 2012.</p>",
    "links": ""
  },
  {
    "displayName": "Rebecca Cavanaugh",
    "alphaName": "rcavanagh",
    "titlePrograms": [
      "Faculty, Art and Design History and Theory, First Year"
    ],
    "image": "/uploadedImages/Parsons_Paris/Faculty/Rebecca_Cavanaugh-crop.jpg",
    "continuingEd": false,
    "noDetail": false,
    "description": "<p>Rebecca Cavanaugh is a decorative arts and design historian, specializing in the early 20th century in France. In addition to teaching, she has published articles for <i>Metropolis Magazine</i> and now works extensively as a freelance French-to-English translator, focusing on art and design texts for exhibitions (Musée des Arts Décoratifs, Musée Matisse, FIAC, IMEC…), art galleries and major publishing houses. Recent translations include Yamamoto & Yohji (2014); Louis Vuitton City Bags (2013); Roger Vivier (2013); and The Carmine Vault, a graphic novel by Fafi (2012), all published by Rizzoli New York</p><p>Rebecca is also a jazz vocalist, performing regularly in and around Paris. She has released two albums, &quot;Looking Back&quot; (2010) and &quot;For All We Know&quot; (2013) on Black and Blue Records, and is currently working on a new duo project called Wonder Room with composer and multi-instrumentalist Jason Domnarski.</p><p>Rebecca earned her Masters Degree in History of Decorative Arts and Design from Parsons The New School for Design in partnership with the Smithsonian's Cooper-Hewitt, National Design Museum.</p>",
    "links": ""
  },
  {
    "displayName": "Brankica Chauvin",
    "alphaName": "chauvin",
    "titlePrograms": [
      "Faculty, Fashion Design"
    ],
    "image": "/uploadedImages/Parsons_Paris/Faculty/Brankica_Zilovic-300x277.jpg",
    "continuingEd": false,
    "noDetail": false,
    "description": "<p>Brankica Chauvin is a visual artist and educator living in Paris. Her ten years lecturing experience has directed her educative focus to creative processes in textile, fashion design and contemporary art. As an artist she creates through the fields of contemporary art embroidery, installations, multimedia, painting and drawing. Her work has been exhibited both on a national and international level. During last 15 years she has developed different projects with art galleries, applied art museums, contemporary art centers, local and regional cultural centers in France ( followed by workshops and lectures), fashion magazines, advertising agencies etc.<p><p>Recently Brankica directed her interest toward exhibitions curating as well. She is the recipient of several awards for painting and drawing. She graduated from the École Nationale Supérieure des Beaux Arts (department of painting) of Paris (DNSAP) and from University of Arts, Faculty of Fine Arts (department of painting) in Belgrade.</p>",
    "links": [
      {
        "label": "zilovic.chauvain.com",
        "url": "http://zilovic.chauvain.com"
      }
    ]
  },
  {
    "displayName": "Emmanuel Cohen",
    "alphaName": "cohen",
    "titlePrograms": [
      "Faculty, History of Design & Curatorial Studies; French"
    ],
    "image": "/uploadedImages/Parsons_Paris/Faculty/emmanuelcohen-bw.jpg",
    "continuingEd": false,
    "noDetail": false,
    "description": "<p>Emmanuel Cohen has a Ph.D. in Performance Studies (Arts du spectacle) from the Université de Picardie – Jules Verne. His dissertation addresses the question of the rejection of drama in modernist theaters, and more precisely within the historical Avant-Gardes in Paris, from the 1910s to the 1930s (Dada, Gertrude Stein and Surrealism). He holds a M.A. in Littérature, Arts et Pensées contemporaines from the Université Paris 7 – Denis Diderot, in exchange with the University of Pennsylvania (2007-2009).</p><p>As a photographer, Emmanuel collaborated with the project Étant Donnée by the Collectif Simple Appareil and the writer Cécile Portier. As a researcher, Emmanuel has published articles on Stein, Dada and Surrealism in several journals and co-organized an international colloquium on theater and its relation to thinking and philosophy, « Le Théâtre pense, certes. Mais quoi ? Comment ? Et où ? », with Christophe Bident and Laure Couillaud at the Maison de la Culture d’Amiens and the Université Paris Ouest – Nanterre La Défense in September 2014. Emmanuel has taught French at UPenn, English at the Institut des Langues Orientales in Paris, and Writing at Université Paris Est – Créteil, and now the French Grad Reading seminar at Parsons Paris.</p>",
    "links": ""
  },
  {
    "displayName": "Laurent Cotta",
    "alphaName": "cotta",
    "titlePrograms": [
      "Faculty, Fashion Studies"
    ],
    "image": "/uploadedImages/Parsons_Paris/Faculty/Cotta_Laurent.jpg",
    "continuingEd": false,
    "noDetail": false,
    "description": "<p>Art and fashion historian Laurent Cotta has been Director of the Contemporary Creation Department at the Palais Galliera for 12 years. Since 2013, he has been developing the Graphic Arts Department of the museum, enriching it with the works of recent fashion illustrators.</p><p>At the Palais Galliera, he is also the curator of several exhibitions and manifestations dedicated to fashion, amongst them: Modes à Suivre (2000 and 2002), Madame Carven, Grand Couturier (2002), Sylvie Vartan, Revue de Mode (2004), Popy Moreni (2005) and the 60th anniversary of the creation of ELLE magazine exhibition at the Galeries Lafayette department store in 2005.</p><p>He also is the co-curator, with Olivier Saillard, of Madame Grès, La Couture à l’Oeuvre at the Musée Bourdelle (2011), of Le XVIIIe au Goût du Jour at the Grand Trianon in Versailles (2011) and of Madame Grès, Sculturale Mode at the MoMu in Antwerp (2013).</p><p>He gave a series of courses on Contemporary Fashion for the Chair of Fashion History at the Ecole du Louvre in 2010. At the IFM, he lectured and was Director of Studies in 2011, and in 2015 he taught courses on Fashion History.</p><p>In October 2011, he gave a series of lectures about Yves Saint Laurent, commissioned by the Alliance Française, in thirteen cities in the United States and in Canada.</p><p>He is author of a monograph about Jean Charles de Castelbajac entitled “My Way”, TeNeues Publishing, 2017.</p>",
    "links": [
      {
        "label": "www.palaisgalliera.paris.fr/",
        "url": "http://www.palaisgalliera.paris.fr/"
      }
    ]
  },
  {
    "displayName": "Sophie Cure",
    "alphaName": "cure",
    "titlePrograms": [
      "Faculty, Art, Media and Technology"
    ],
    "image": "/uploadedImages/Parsons_Paris/Faculty/sophie-cure_id-bw200.jpg",
    "continuingEd": false,
    "noDetail": false,
    "description": "<p>Sophie Cure is a graphic designer. She holds a MA from the École Nationale Supérieure des Arts Appliqués et des Métiers d'Arts (ENSAAMA - Paris). After having worked in the Netherlands, she created her own studio.</p><p>She is interested in alternative teaching methods and created typographic tools to help children advance their reading skills. She has been leading workshops for those with dyslexia and young people who have difficulty reading. Together with Aurélien Farina, she conceived a booklet of games to introduce people to graphic design, published by the intentional graphic design festival in Chaumont, France.</p><p>In parallel, she designs graphic objects for architects, publishers and a variety of companies (logos, books, websites, posters, packaging…). With a minimalist style, her work frequently combines typography with elemental shapes. She likes to conceive playful systems of creation and responsive designs.</p><p>Since 2014, her studio has been based in &#34;Les Ateliers de Paris&#34; where she is a resident.</p>",
    "links": [
      {
        "label": "www.sophiecure.com",
        "url": "http://www.sophiecure.com"
      }
    ]
  },
  {
    "displayName": "Stephanie Daudier",
    "alphaName": "daudier",
    "titlePrograms": [
      "Faculty, Strategic Design & Management"
    ],
    "image": "/uploadedImages/Parsons_Paris/Faculty/Daudier_Stephanie_300x300.jpg",
    "continuingEd": false,
    "noDetail": false,
    "description": "<p>Stephanie Daudier is a leadership coach and a senior business advisor. She offers a deep corporate experience in the luxury beauty industry, leading businesses in Europe and Asia, including expatriate experiences in The Czech Republic and Japan.</p><p>Stephanie is the founder of The Inspiration Lab, based in Paris, France, a coaching and consulting practice that provides individual and group leadership coaching for senior executives and entrepreneurs in luxury, digital, finance and other industries.</p><p>Stephanie holds a scientific master’s degree (Paris Sorbonne University, France), a neuro-linguistic programming master practitioner certification of (NLP University, Santa Cruz, Ca, USA), a master’s degree in coaching & consulting for change (INSEAD, France).</p>",
    "links": ""
  },
  {
    "displayName": "Félicie d'Estienne d'Orves",
    "alphaName": "destienne-dorves",
    "titlePrograms": [
      "Faculty, Art, Media and Technology"
    ],
    "image": "/uploadedImages/Parsons_Paris/Faculty/d_Estienne d_Orves_Felicie.jpg",
    "continuingEd": false,
    "noDetail": false,
    "description": "<p>Born in 1979 in Greece, Felicie d'Estienne d'Orves is a French new media artist whose work combines light, sculpture and new technologies. Her research focuses on vision, it’s processes and conditioning. Her immersive installations use a phenomenological approach to reality, they underscore the perception of time as a continuum. Since 2014, the artist’ researches focused on space in relation to astrophysics and to study the natural light cycles.</p><p>She holds a multimedia degree and a master degree in interactive research (A.R.I.) from École nationale supérieure des Arts Décoratifs (ENSAD Paris). Her work has been shown at the Centre Pompidou (Paris / FR) – Nuit Blanche (Paris / FR) – Le Centquatre / Nemo International Biennial of Digital Arts (Paris / FR) – Pommery Champagne Cellars (FR) – New Art Space / Sonic Acts (Amsterdam / NL) – Watermans Arts Center (London / UK) – Elektra Festival / BIAN (Montreal / CA) – OCAT (Shanghai / CN) – Aram Art Museum (Goyang / KR) – Luz y Vanguardias (ES) – Day For Night (Houston / US), etc.</p>",
    "links": "http://www.37-2.com/works/18/the-whitewalkers"
  },
  {
    "displayName": "Aurélien Farina",
    "alphaName": "farina",
    "titlePrograms": [
      "Faculty, Art, Media and Technology"
    ],
    "image": "/uploadedImages/Parsons_Paris/Faculty/aurelienfarina-200.jpg",
    "continuingEd": false,
    "noDetail": false,
    "description": "<p>Aurélien Farina is a French-Swiss graphic designer, primarily active in the fields of editorial and print design. His work focuses on interaction and playfulness as general design notions, using simple tools and processes and considering all graphic design creations as graphic objects. His works are often based on a modular, evolutionary, and user-oriented approach, in which the viewer/reader plays as important a role as the designer himself; whether using typography, shapes, images or materiality, the design is meant not to impose strict and static forms, but rather to propose open and dynamic setups, scenarios, possibilities. </p><p>Aurélien Farina studied at Sciences-Po Paris, from which he graduated with a master's degree in cultural management, before studying graphic design at the HEAD-Geneva, where he taught typography and editorial design from 2012 to 2015. He founded the Paper! Tiger! studio in 2011, and has collaborated with a number of other designers and artists on graphic design projects and small-press publishing. Since 2014, Paper! Tiger! is based in a street-level shop in the 3rd arrondissement of Paris, open to co-workers, friends, and visitors alike. </p>",
    "links": [
      {
        "label": "facebook.com/papertiger.design",
        "url": "http://eyewriter.org"
      }
    ]
  },
  {
    "displayName": "Claudia Fontu",
    "alphaName": "fontu",
    "titlePrograms": [
      "Faculty, French"
    ],
    "image": "/uploadedImages/Parsons_Paris/Faculty/Fontu_Claudia.jpeg",
    "continuingEd": false,
    "noDetail": false,
    "description": "<p>Claudia A. Fontu is Professor of French language, French literature and cinema, and Theater at the University of California, University of Southern California, and Columbia University in Paris. She also teaches oral French language practice and Pronunciation at the Institute of Phonetics, Paris.</p><p>After completing six years of Doctoral Studies in American literature at Paris III Sorbonne Nouvelle, she has been invited as a Visiting Scholar at USC, Los Angeles, where she taught classes of French language and civilization. She holds both an M.A. in French literature and an M.A. in American literature from Paris III Sorbonne Nouvelle, and an M.A. in Contemporary Philosophy. The City of Lights as both a muse and an open laboratory for linguistic, artistic and literary creation is her main field of interest and the topic of her language, literature and cinema courses.</p><p>A former radio journalist, she is also a painter.</p>",
    "links": ""
  },
  {
    "displayName": "Monica Fraile Morisson",
    "alphaName": "frailemorisson",
    "titlePrograms": [
      "Faculty, Fashion Design"
    ],
    "image": "/uploadedImages/Parsons_Paris/Faculty/FraileMorisson-Monica-300.jpg",
    "continuingEd": false,
    "noDetail": false,
    "description": "<p>Monica Fraile Morisson is a graphic designer working primarily with typography, in branding, publishing, and web design. Born in Paris, she is a graduate from the School of Visual Arts (SVA) in New York City, and first started working with Tony Palladino, her mentor.</p><p>With ten years of independent practice in corporate design and book design, and more recently typeface design, her work has been featured in the Tokyo TDC vol.27, TipoGrafica magazine, Graphis, Laurence King, and Pyramyd publications. Awards include: Tokyo Type Directors Club, excellence awards, 2016. Hiiibrand awards, 2015.</p>",
    "links": [
      {
        "label": "monicafraile.com/",
        "url": "http://www.monicafraile.com/"
      }
    ]
  },
  {
    "displayName": "Kathryn Frost",
    "alphaName": "frost",
    "titlePrograms": [
      "Faculty, First Year"
    ],
    "image": "/uploadedImages/Parsons_Paris/Faculty/photo_frost_crop.jpg",
    "continuingEd": false,
    "noDetail": false,
    "description": "<p>Kathryn Frost (née Stutts) is an independent architectural designer based in Paris since 2008. She worked in New York and Dublin prior to arriving in Paris and joining the office of Jean Nouvel. There she helped create a 3d parametric model for the dome canopy of the Louvre Abu Dhabi. This interdisciplinary process was the subject of a paper co-authored and presented by Kathryn at the Advances in Architectural Geometry conference in Paris in 2012. Her current practice focuses on small-scale structures and cabins using design-build. Kathryn has also collaborated with the French NGO Architecture & Developpement on several projects including the design of a bio-climatic center for mental health care in Kinshasa, DRC.</p><p>Kathryn received her BS and Master’s degrees in architecture from the University of Virginia in 2003 and Yale University in 2008. In addition to teaching Sustainable Systems at Parsons Paris, she leads the architectural design studio for the Paris Program of Catholic University of America. Her current research and writing focus on the interaction between human and natural systems, and how to use new technological tools to improve our relationship with our environment at both local and global scales. This includes multidisciplinary practices of urban agriculture, micro-energy and material salvage.</p>",
    "links": ""
  },
  {
    "displayName": "Maurizio Galante",
    "alphaName": "galante",
    "titlePrograms": [
      "Faculty, Fashion Design"
    ],
    "image": "/uploadedImages/Parsons_Paris/Faculty/Galante_Maurizio.jpg",
    "continuingEd": false,
    "noDetail": false,
    "description": "<p>Italian fashion designer Maurizio Galante is one of the most respected Parisian couturiers. Over the past 30 years, his creative talent and body of work has earned him numerous prestigious awards in Italy, France and beyond.</p><p>In 2008 he was made “Chevalier dans l’Ordre des Arts et des Lettres à Paris” by the Ministry of Culture for his contribution to the French fashion industry. He has presented his haute couture collections in Paris since 1991 as an official member of the very closed circle of the “Chambre Syndicale de la Haute Couture,” a prestigious group of Parisian fashion houses.</p><p>He designs costumes for theatre and opera, and has worked with famous directors, including Luca Ronconi and Giorgio Ferrara for the Piccolo Theatre of Milan, the Rome Opera, and Spoleto Festival Theatre.</p><p>Maurizio Galante creations are included in the permanent collections of prominent international Fashion and Art museums and he has participated in various exhibitions, including the Victoria & Albert museum in London, the Museum of Decorative Arts in the Louvre in Paris, Galliera museum in Paris, Kyoto Fashion Museum, MOMA museum of modern art in New York, Grand Palais in Paris, the Museum of Art and Industry in Saint Etienne, Triennial Design museum in Milan, MUDAM Modern Art Museum in Luxembourg, and Pompidou Centre in Paris.</p>",
    "links": [
      {
        "label": "www.maurizio-galante.com/",
        "url": "http://www.maurizio-galante.com/"
      }
    ]
  },
  {
    "displayName": "Jason Glasser",
    "alphaName": "glasser",
    "titlePrograms": [
      "Faculty, First Year"
    ],
    "image": "/uploadedImages/Parsons_Paris/Faculty/Glasser-Jason-300.jpg",
    "continuingEd": false,
    "noDetail": false,
    "description": "<p>Jason Glasser is an American artist and educator who lives and works in Paris, France. His diverse artistic practice has produced works in painting and drawing, installation, film and video, photography, performance and musical composition. His work has been shown internationally and appears in the collections of the Centre National des Arts Plastiques, France, the P.S.1 Contemporary Art Center in New York, and Le Point Ephémère, Paris, France.</p><p>Recent projects include a one person show at Parker’s Box gallery in New York, a collaboration with clothing designer Vanessa Seward for the brand A.P.C, an interactive video project for the Centre Georges Pompidou, and a series of musical collaborations with the musician Peter Von Poehl for the Bodum design brandJason Glasser received a B.F.A. in painting at the University of Massachusetts, Amherst, and an M.F.A. at Hunter College in New York City. He has taught at the Brooklyn Museum of Art, the American School of Paris, the Massachusetts College of Art and Design, and the Paris College of Art. </p>",
    "links": [
      {
        "label": "www.jasonglasser.com",
        "url": "http://www.jasonglasser.com"
      }
    ]
  },
  {
    "displayName": "Emmanuel Guy",
    "alphaName": "guy",
    "titlePrograms": [
      "Director, Art & Design History & Theory; History of Design & Curatorial Studies"
    ],
    "image": "/uploadedImages/Parsons_Paris/Faculty/emmanuel-guy-cropped.jpg",
    "continuingEd": false,
    "noDetail": false,
    "description": "<p>Emmanuel Guy is Assistant Professor of Art and Design History. His research focuses on the history and theory of 20th-century avant-garde and counterculture in the art, design, architecture, literature and politics. He graduated from the École Normale Supérieure, Paris, in 2007, and obtained his Agrégation de Lettres Modernes the same year. Emmanuel curated, among other exhibitions, the “Guy Debord. Un Art de la Guerre” exhibition at the Bibliothèque nationale de France in 2013, and defended his dissertation on Guy Debord the following year. He has published numerous articles and books on Guy Debord and the Internationale Situationniste, including exhibition catalogues, essays and archival material. His last book, co-edited with Laurence Le Bras from the National Library, is entitled Reading Debord (Montreuil, L'Échappée, 2016).</p><p>Emmanuel has taught in the Métiers du texte et de l’image Master's Program at Université Sorbonne Paris Cité. From 2009 to 2011, he co-organized with Sophie Cras (Maître de conférence, Université Panthéon-Sorbonne) the seminar &quot;1955-1965: sources and methods&quot; at the Ecole Normale Supérieure, where they gathered a wide range of young researchers and scholars from various disciplines to discuss the history and historiography of the long sixties. Following the same research methodology, they are currently organizing a monthly seminar on the arts in the 1980s at Parsons Paris.</p><p>Emmanuel's teaching philosophy is based on active learning, bridging theory and practice, scholarship and curation, and fostering critical thinking and political consciousness among his students. At Parsons Paris, he regularly teaches courses to graduate students such as Proseminar: A Toolkit for the Design Historian, or Objects Matter: a Critical Survey of Design History. He also supervises the liberal arts offering for undergraduate students and teaches, among other courses, &quot;This is not an object: avant-garde and material culture&quot; where students explores parallel histories of the avant-garde in the visual arts and in design.</p>",
    "links": [
      {
        "label": "Guy Debord. Un Art de la Guerre",
        "url": "http://www.bnf.fr/fr/evenements_et_culture/calendrier_expositions/f.debord.html"
      },
      {
        "label": "<i>La Fabrique du cinéma de Guy Debord</i>",
        "url": "http://www.actes-sud.fr/catalogue/cinema/la-fabrique-du-cinema-de-guy-debord"
      },
      {
        "label": "<i>Reading Debord</i>",
        "url": "http://www.lechappee.org/lire-debord"
      },
      {
        "label": "The 1980s : Sources and Methods. A Transdisciplinary Research Seminar co-organised by Parsons Paris, Université Panthéon Sorbonne, Université de Tours",
        "url": "https://lesannees1980.wordpress.com/"
      },
      {
        "label": "Counselor for the European Postwar and Contemporary Art Forum (EPCAF)",
        "url": "http://epcaf.org/"
      }
    ]
  },
  {
    "displayName": "Emilie Hammen",
    "alphaName": "hammen",
    "titlePrograms": [
      "Faculty, Fashion Design, Art and Design History and Theory"
    ],
    "image": "/uploadedImages/Parsons_Paris/Faculty/Hammen,Emilie-300.jpg",
    "continuingEd": false,
    "noDetail": false,
    "description": "<p>Emilie Hammen is a PhD candidate in Art History at Université Paris 1, Panthéon-Sorbonne, and a researcher/lecturer at the Institut Français de la Mode, Paris. Her research focuses on the historiography of fashion.</p><p>She holds an MA in Fashion Design from the Ecole Supérieure des Arts Appliqués Duperré and a postgraduate degree in Fashion Design from the Institut Français de la Mode. She also completed an MA in Art History at Université Paris 1.</p><p>A practitioner as well as a theorist, she worked as a designer for Louis Vuitton and Marc Jacobs from 2009 to 2014. She assisted curators for the Design Parade festival and competition (Hyères, France) from 2005 to 2010 and has worked for trend forecasting companies.</p><p>Her articles on contemporary fashion and her research papers have been published in Mode de Recherche, L’Architectured’Aujourd’hui, Magazine, and in the most recent book published by the Institut Français de la Mode, &quot;Repères/Mode et Luxe. Economie, culture et marketing&quot; (2014). She also writes on design and fashion for the independent online review Strabic.</p>",
    "links": [
      {
        "label": "Mode de Recherche",
        "url": "http://www.ifm-paris.com/en/research-and-publishing/mode-luxe-design/academic-research/research-review.html"
      },
      {
        "label": "Strabic",
        "url": "http://www.strabic.fr"
      }
    ]
  },
  {
    "displayName": "Arnaud Hédin",
    "alphaName": "hedin",
    "titlePrograms": [
      "Faculty, French"
    ],
    "image": "/uploadedImages/Parsons_Paris/Faculty/Hedin_Arnaud.jpg",
    "continuingEd": false,
    "noDetail": false,
    "description": "<p>Arnaud Hédin studied French as a foreign language (Maîtrise F.L.E.) at the University of Nottingham and the Université Paris V Sorbonne, and French literature at the University of Chicago.  He taught French courses both at the University of Chicago and at the University of Chicago Center in Paris. He holds a Maîtrise in LCE anglais (Université Paris Diderot).</p>",
    "links": ""
  },
  {
    "displayName": "Alexandra Helminger",
    "alphaName": "helminger",
    "titlePrograms": [
      "Faculty, Fashion Design"
    ],
    "image": "/uploadedImages/Parsons_Paris/Faculty/Helminger_Alexandra.jpg",
    "continuingEd": false,
    "noDetail": false,
    "description": "<p>Alexandra Helminger is a fashion designer, born in Austria but having lived and worked in Germany, Belgium and France. She moved to Paris in 2014 when she joined Lanvin, where, under the direction of Alber Elbaz, she worked on both main collections and pre-collections.</p><p>Alexandra received her BA and MA in Fashion Design from The Royal Academy of Fine Arts in Antwerp in 2013. Her MA collection was included in the 2013 Festival for Fashion and Photography at the Museum für angewandte Kunst (MAK) in Vienna. It was during her time at the Academy that she discovered working in 3D, which allowed her to experiment with volumes and proportions, and their effects on our perception of the body and space.</p><p>Alexandra previously studied Art History at the University of Vienna, and worked as a costume designer for a number of theatre productions in Germany.</p>",
    "links": ""
  },
  {
    "displayName": "Lily Hibberd",
    "alphaName": "hibberd",
    "titlePrograms": [
      "Faculty, First Year"
    ],
    "image": "/uploadedImages/Parsons_Paris/Faculty/Hibberd_Lily__300x300.jpg",
    "continuingEd": false,
    "noDetail": false,
    "description": "<p>Lily Hibberd is an artist, curator and writer, with a PhD in contemporary art from Monash University Australia. Her interdisciplinary and collaborative practice concerns marginalized memory and perceptions of time encompassing performance, writing, painting, sculpture, photography, virtual reality and 3D immersive cinema, video, sound and installation art. In 2015 she partnered with the Observatoire de Paris to realise the exhibition First Light at Musée des arts et métiers.</p><p>She is founding editor of the experimental art writing publication <i>unMagazine</i>, co-founder of Parragirls Memory Project and postdoctoral fellow at LARCA Université Paris Diderot.</p>",
    "links": [
      {
        "label": "www.lilyhibberd.com",
        "url": "http://www.lilyhibberd.com"
      },
      {
        "label": "unprojects.org.au",
        "url": "http://unprojects.org.au"
      },
      {
        "label": "www.pffpmemory.org.au",
        "url": "https://www.pffpmemory.org.au"
      }
    ]
  },
  {
    "displayName": "Vanessa Hope",
    "alphaName": "hope",
    "titlePrograms": [
      "Faculty, ESL"
    ],
    "image": "/uploadedImages/Parsons_Paris/Faculty/Hope_Vanessa__300x300.jpg",
    "continuingEd": false,
    "noDetail": false,
    "description": "<p>Vanessa Hope is an English professor. Born in Connecticut, she has been an “American in Paris” for many years and holds a Master’s Degree in English Language, Literature and Civilization from Paris-Diderot University. She teaches English at Dauphine University and is an English trainer at Jones Lang LaSalle. Vanessa has also been a translator for over a decade. Some of her most notable translations include the subtitles of the documentaries Terre des Ours (Land of the Bears) and Flore. She also has experience in the fashion industry, having worked as a Showroom Sales Associate for luxury brands, such as Balmain, Chloé and Hermès.</p>",
    "links": ""
  },
  {
    "displayName": "Clémence Imbert",
    "alphaName": "imbert",
    "titlePrograms": [
      "Faculty, Art and Design History and Theory"
    ],
    "image": "/uploadedImages/Parsons_Paris/Faculty/ClemenceImbert-bw-200.jpg",
    "continuingEd": false,
    "noDetail": false,
    "description": "<p>Clémence Imbert is an art and design teacher and researcher. With a background in French Literature, she worked as a curatorial assistant at the Centre Pompidou (Paris) and at the Guggenheim Museum (New York). For the last two years, she has been teaching modern art history and museums studies at Paris 8 University. She is also a member of the editorial committee of Marges, a contemporary art journal.</p><p>Clémence is currently writing her Ph.D. dissertation on graphic design exhibitions in modern art museums. Based on an historical survey of curatorial practices at the MoMA, the Stedelijk Museum of Amsterdam and the Centre Pompidou since 1970, her research addresses the various curatorial issues surrounding posters and other printed material. Her recent talks and papers focused among others on the institutional and intellectual dynamics at stake in the process of &quot;aestheticization&quot; of objects designed for the daily life.</p>",
    "links": ""
  },
  {
    "displayName": "Paul Jobling",
    "alphaName": "jobling",
    "titlePrograms": [
      "Faculty, Fashion Studies"
    ],
    "image": "/uploadedImages/Parsons_Paris/Faculty/Jobling_Paul__300x300.jpg",
    "continuingEd": false,
    "noDetail": false,
    "description": "<p>Professor Paul Jobling studied History of Art with Philosophy at University College London before completing an MA by thesis at the Royal College of Art, London: ‘The Evolution of Popular Illustrated Journalism in France during the 19th Century.’ His PhD was taken at the University of Warwick's Centre for British and Contemporary Cultural Studies: ‘Fashion Figures: word and image in contemporary fashion photography’.</p><p>He moved from being a Curator at the V&A, to lectureships and research in Schools of Art and Design History in Newcastle upon Tyne, Staffordshire, Kingston University and the University of Brighton between 2001 and 2018.</p><p>Paul Jobling is an internationally recognised expert in the history and theory of graphic design and photography since the 19th century with a particular interest in the intertextuality of word and image and issues of identity in advertising, fashion photography, magazine design, photojournalism and photodocumentary. His books include <i>Advertising Menswear: Masculinity and Fashion in the British Mass media since 1945</i> (Bloomsbury, 2014), which won an award for outstanding academic title in 2014 from the American Libraries Association (Choice, January 2015), <i>Man Appeal: advertising, modernism and masculinity</i>, (Oxford and New York: Berg, 2005); and <i>Fashion Spreads— word and image in fashion photography since 1980</i>, (Oxford and New York: Berg, 1999). He is also a regular contributor of articles and reviews to the <i>Journal of Design History and Fashion Theory</i>, and has spoken at many conferences in the UK and overseas.</p><p>He is currently a member of the Peer Review College for the AHRC and the Australian Research Council.</p>",
    "links": ""
  },
  {
    "displayName": "Miriam Josi",
    "alphaName": "josi",
    "titlePrograms": [
      "Faculty, First Year"
    ],
    "image": "/uploadedImages/Parsons_Paris/Faculty/Miriam_Josi.jpg",
    "continuingEd": false,
    "noDetail": false,
    "description": "<p>Miriam Josi is an independent product designer based in Paris since 2014. She was born in Bern, Switzerland, where she obtained her teaching degree. She has lived all over the globe and studied at the School of Fine Arts in San Juan, Puerto Rico; ENSCI–les Ateliers in Paris; and Parsons School of Design in New York City.</p><p>&quotLow-tech minimalism&quot describes Josi’s aesthetics and overall design approach, as well as the manufacturing processes she chooses for her projects.</p><p>Her work has  been exhibited at Paris Design Week, Now! le Off, D’Days, NYCxDesign, London Design Festival, Salone dei Tessuti in Milan, the Museum of Applied Arts in Berlin and Hôtel de Villein Paris.</p>",
    "links": [
      {
        "label": "www.miriam-josi.com",
        "url": "http://www.miriam-josi.com"
      }
    ]
  },
  {
    "displayName": "Anna Krutiy",
    "alphaName": "krutiy",
    "titlePrograms": [
      "Coordinator, Strategic Design & Management"
    ],
    "image": "/uploadedImages/Parsons_Paris/Faculty/Krutiy_Anna.jpeg",
    "continuingEd": false,
    "noDetail": false,
    "description": "<p>Anna Valerie Krutiy graduated with a BA double major in Art History and French language and Literature from Boston University, and a MSc in Marketing Management from EDHEC Business School in Lille, France.</p><p>Her professional experience includes working in production coordination of ready-to-wear in Chanel Paris and management of fashion jewelry and accessories collections at Swarovski SAS. She is currently working as Project Manager France at The Woolmark Company, an international industry of wool textiles and innovations. Anna is responsible for strategic communications and collaborations in the French market. Recent collaborations included projects with French designers Jacquemus and Koché and international brands such as Zadig & Voltaire and Cerruti 1881, and partnering in events such as Vogue Fashion Festival, Fashion and Photography Festival de Hyères.</p>",
    "links": ""
  },
  {
    "displayName": "Clarisse Labro",
    "alphaName": "labro",
    "titlePrograms": [
      "Faculty, First Year"
    ],
    "image": "/uploadedImages/Parsons_Paris/Faculty/ClarisseLabro-300.jpg",
    "continuingEd": false,
    "noDetail": false,
    "description": "<p>Clarisse Labro studied studio arts at Bard College and architecture at Yale University.  In 2011 she and her partner opened a studio in Paris after working for Shigeru Ban and Jean Nouvel respectively. They work on architectural projects and collaborations of different scales and genres across Europe primarily.</p>",
    "links": ""
  },
  {
    "displayName": "Tal Lancman",
    "alphaName": "lancman",
    "titlePrograms": [
      "Faculty, Fashion Design"
    ],
    "image": "/uploadedImages/Parsons_Paris/Faculty/Lancman_Tal.jpg",
    "continuingEd": false,
    "noDetail": false,
    "description": "<p>Born in Tel-Aviv, Israel, in 1962, Tal Lancman is a trend forecast analyst and designer. He has been the editor-creative director for Textile View magazine, the leading industry magazine defining trends in colors, textile, fashion, decoration, and marketing between the years 1995-2013.</p><p>His contribution for the series “Interware” and “The Art of Living” published in Textile View focused on the transversal approach, emphasizing the meeting point between different disciplines: design, fashion, architecture and art.</p><p>Tal Lancman’s broad spectrum of design and consultancy experiences range from companies in the fields of textiles and fashion, to design and beauty. Clients and collaborations include Baccarat; Boffi; Baleri, Chopard; Driade, Felissimo Japan; Itochu; Lasvit, Limited NY; L’Oreal Paris; Reebok; Shiseido; Tai Ping, and Veronese.</p><p>He has exhibited his work at the Musée des Arts Décoratifs, Paris; MOMA Museum of Modern Art, NY; MUDAM Museum of Modern Art, Luxembourg; Musée d’Art et d’Industrie of Saint-Etienne; Milan’s Triennale Design Museum, Pompidou Center Paris and curated design exhibitions in France, USA and Israel.</p><p>In 2003 Tal Lancman, in partnership with Haute Couture designer Maurizio Galante, founded the design and consultancy agency INTERWARE, which aims at establishing a balance between the industrial and the craftsmanship’s traditions, welcoming the best of both fields.</p>",
    "links": [
      {
        "label": "www.maurizio-galante.com",
        "url": "http://www.maurizio-galante.com/"
      }
    ]
  },
  {
    "displayName": "Christophe Lemaitre",
    "alphaName": "lemaitre",
    "titlePrograms": [
      "Faculty, First Year"
    ],
    "image": "/uploadedImages/Parsons_Paris/Faculty/headshot-male.jpg",
    "continuingEd": false,
    "noDetail": false,
    "description": "<p>Since 2010, artist, publisher and curator Christophe Lemaitre has been developing work tackling strategies of image production and/or disappearance, as well as maintaining an independent curatorial practice (as the co-director of Super, project space in Paris, 2008–2010).</p><p>From 2011-2012, he was a long-term researcher at the Jan van Eyck Academie, Maastricht (Netherlands). Christophe Lemaitre is also the co-editor of ‘<i>Postdocument</i>’, a regular publication focused on exhibition photography.</p><p>In 2014 he was invited to collaborate on the artistic direction of the Cneai art center for one year, where he developed several new exhibitions and long-term projects including ‘The Life and Death of Works of Art’ and ‘The Long Panoramic Image of a Revolving Artwork’.</p><p>He has published several books : <i>The Life and Death of Works of Art</i> (Tombolo Presses, 2016), <i>The Book of Go</i> (Funded by FNAGP, 2015), <i>Machine</i> (Mac/Val, 2013), <i>Frr frr – La Mode et son destin dans l’œuvre de Marcel Duchamp</i> (Parc Saint Léger, 2010).</p><p>He has exhibited in numerous institutions including Le Confort Moderne (2018), Doc! (2017), Cneai (2015), Centre Pompidou (2015), Mac/Val (2013), Shanaynay (2013) and Bonnefanten Museum (2012).</p>",
    "links": [
      {
        "label": "onemore-studio.com",
        "url": "http://onemore-studio.com"
      }
    ]
  },
  {
    "displayName": "Natasha Llorens-Perkins",
    "alphaName": "llorens-perkinstti",
    "titlePrograms": [
      "Faculty, History of Design & Curatorial Studies"
    ],
    "image": "/uploadedImages/Parsons_Paris/Faculty/Llorens_Natasha.jpg",
    "continuingEd": false,
    "noDetail": false,
    "description": "<p>Natasha Llorens-Perkins  is a graduate of the Center for Curatorial Studies at Bard College and a Ph.D. candidate in art history at Columbia University. Her academic research is focused on violence and representation in the art from South Africa and Algeria in 1970s and 1980s.</p><p>She has a curated exhibitions in a number of universities and galleries in the US, France, Norway, Lebanon, the UK, Sweden and Spain.</p>",
    "links": ""
  },
  {
    "displayName": "Luca Marchetti",
    "alphaName": "marchetti",
    "titlePrograms": [
      "Faculty, Fashion Studies"
    ],
    "image": "/uploadedImages/Parsons_Paris/Faculty/Luca_Marchetti.jpg",
    "continuingEd": false,
    "noDetail": false,
    "description": "<p>Luca Marchetti is a professor and researcher at the Université du Québec à Montréal (UQAM), contract professor of highest repute at the University of Bologna, and senior lecturer at the Institut Français de la Mode (IFM) (Paris). Based in Paris, Marchetti works internationally as a brand consultant and exhibition curator. He regularly contributes to editorial publications on fashion and design and collaborates with magazines like <i>Vogue</i> and <i>Domus</i>.</p><p>Among Marchetti’s curatorial projects are Blasé (with Hadas Zucker, Shanghai and Bologna, 2016), <i>Tillmann Lauterbach: Object of Ordinary Madness</i> (Vienna, 2014), and <i>Foulards</i> (Lyon, 2013). He co-curated the exhibitions <i>Basic Instincts</i> (Berlin, 2011; Shanghai, 2012), <i>Dysfashional</i> (Luxembourg, 2007; Lausanne, 2008; Berlin, 2009; Paris and Moscow, 2010; Jakarta, 2011) and <i>EN:TRANCE</i> (Bolzano, 2004; Paris, 2007) with Emanuele Quinz.</p>",
    "links": ""
  },
  {
    "displayName": "Rachel Marks",
    "alphaName": "marks",
    "titlePrograms": [
      "Faculty, First Year"
    ],
    "image": "/uploadedImages/Parsons_Paris/Faculty/Marks_Rachel__300x300.jpg",
    "continuingEd": false,
    "noDetail": false,
    "description": "<p>Rachel Marks received her MFA from l’Ecole Supérieure d’Art et Design of Grenoble in 2013 and her BFA in Drawing and Painting from Oklahoma State University. She is a transdisciplinary artist working with sculpture, drawing, painting, installation and performance. Her background in dancing with the Oklahoma City Ballet transposes into her performances, using dance as an artistic medium.</p><p>Rachel’s work looks at the relationship between nature and language by investigating identity and communication. Her works and performances are regularly shown in France as well as internationally including : Children's Museum of the Arts in New York, Musée de la Chasse et de la Nature in Paris, Spring Break Art Show in New York, Imagine Science Film Festival-National Sawdust in New York, Gallery U10 in Belgrade, The Grand Palais in Paris, Instituto Municipal de Arte y Cultura in Tijuana, Gallery Gong in Seoul, SMOArts Bay Gallery in San Francisco, Untitled Space in New York, Bastille Design Center in Paris.</p><p>Rachel’s work has also been included in many publications such as the Highlike Book by SESI publishing house in Sao Paulo, Point Contemporain in Paris, Imago Mundi Contemporary Art Book and collection by Fondazione Luciao Benetton.</p>",
    "links": ""
  },
  {
    "displayName": "Giulia Mensitieri",
    "alphaName": "mensitieri",
    "titlePrograms": [
      "Faculty, Fashion Studies"
    ],
    "image": "/uploadedImages/Parsons_Paris/Faculty/Giulia_Mensitieri.jpg",
    "continuingEd": false,
    "noDetail": false,
    "description": "<p>Giulia Mensitieri holds a PhD in Social Anthropology and Ethnology from the Ecole des Hautes Etudes en Sciences Sociales de Paris. Her work explores the construction of desirable imaginaries and forms of precarity in contemporary capitalism through an examination of the fashion world. Through an ethnographic study of &quotimmaterial&quot workers (stylists, models, photographers, designers, journalists, makeup artists), she explores the fashion system by analyzing global circulations of imaginaries, products, and workers, as well as productions of subjectivities and the modes of subjugation that are typical of this industry.</p><p>Mensitieri also holds a MA in Urban Studies (Territoires, Espaces et Sociétés) from the Ecole des Hautes Etudes en Sciences Sociales of Paris and an MA in Humanities (Hispano-American and Brazilian Languages and Literatures) from the Istituto Universitario Orientale of Naples. She has conducted ethnographic research in Mexico City, Naples, Paris, Brussels, Bordeaux, and Geneva. She is currently a postdoctoral fellow at the Université Libre de Bruxelles (Maison des Sciences Humaines) and she is working on the production of desirable imaginaries in contemporary capitalism.</p><p>Mensitieri is the author of &quot;Le Plus Beau Métier du Monde : Dans les coulisses de l'industrie de la mode&quot;, published by Editions La Découverte, January 2018.</p>",
    "links": ""
  },
  {
    "displayName": "Mathieu Merlet Briand",
    "alphaName": "briand",
    "titlePrograms": [
      "Faculty, Art, Media & Technology"
    ],
    "image": "/uploadedImages/Parsons_Paris/Faculty/Merlet Briand_Mathieu.jpg",
    "continuingEd": false,
    "noDetail": false,
    "description": "<p>Mathieu Merlet Briand graduated from the Ecole Nationale Supérieur des Arts Décoratifs in Paris in 2013. He continued his studies in the research cycle at EnsadLab, the EnsAD Research Laboratory. A digital native from a farming family, Mathieu is interested in the influence of technology on the perception of our contemporary reality.</p><p>Environmental issues recurrently emerge from his projects (see his solo-show &quot;#iceberg&quot; 2017, &quot;Environment&quot; 2017). Inspired by the philosophical essay of Ariel Kyrou, &quot;Google God&quot;, 2010, he questions this almost divine image associated with the giants of the web (see the exhibition &quot;non-site&quot; from the Dauphine Prize for Contemporary Art 2016).</p><p>Mathieu Merlet Briand has participated in numerous solo and collective exhibitions in France and abroad, including: the Moscow Biennale of Contemporary Art at the New Tretyakov Gallery, Art Geneva, the YIA Art Fair at the Musée des Arts et Métiers and Variation - New Media Art Fair at the Cité International des Arts.</p>",
    "links": [
      {
        "label": "mathieumerletbriand.com",
        "url": "http://www.mathieumerletbriand.com"
      },
      {
        "label": "instagram.com/mathieumerletbriand/",
        "url": "https://www.instagram.com/mathieumerletbriand/"
      }
    ]
  },
  {
    "displayName": "Maurits Montanez",
    "alphaName": "montanez",
    "titlePrograms": [
      "Faculty, Strategic Design & Management"
    ],
    "image": "/uploadedImages/Parsons_Paris/Faculty/Montanez_Maurits__300x300.jpg",
    "continuingEd": false,
    "noDetail": false,
    "description": "<p>Maurits Montanez is an entrepreneur and educator who works at the intersection of technology and culture. He specializes in the creation of new media and interactive digital experience for culture dissemination.</p><p>He is the founder of Manuvo, a design consultancy that helps cultural organizations harness the power of digital technologies to engage their audiences and appeal to new ones. In 2016, the MIT Technology Review named Maurits to its list of Innovators Under 35, an honor given to young innovators at the vanguard of technology finding solutions to global problems.</p>",
    "links": ""
  },
  {
    "displayName": "Justin Morin",
    "alphaName": "morin",
    "titlePrograms": [
      "Faculty, Fashion Studies"
    ],
    "image": "/uploadedImages/Parsons_Paris/Faculty/portrait_morin-300.jpg",
    "continuingEd": false,
    "noDetail": false,
    "description": "<p>French artist Justin Morin leads JMStudio, a structure dedicated to his set-design collaborations, window installations and editorial propositions. He has worked with brands like Carven (installation for the Fall/Winter 2016 menswear collection) and Louis Vuitton (collaboration for the Fall/Winter 2016 womenswear show and windows display). As a set designer, he’s been published in various magazines such as <i>Air France Madame</i>, <i>Purple</i> and <i>Vogue China</i>. He is represented by Capital Gallery (San Francisco) and Last Resort (Copenhagen). Since 2010, he’s taught curatorial practices at the Ecole Nationale Supérieure d’Art et de Design, Nancy.</p><p>Thanks to his knowledge of the cultural world, Justin Morin contributes to several magazines, from <i>Vogue Italia</i> to <i>Les Inrocks</i>. Since 2015 he has served editor in chief of <i>Revue</i>, a bi-annual magazine dedicated to arts and fashion. <i>Revue</i> has been devised as a place where images can converse with words and vice-versa. Dance, music, cinema, fashion - all disciplines are combined, from one encounter to the next, offering a unique portrait of what makes the French cultural scene so richly diverse, without confining itself within the bounds of increasingly illegitimate borders.</p>",
    "links": ""
  },
  {
    "displayName": "Dominique Moulon",
    "alphaName": "moulon",
    "titlePrograms": [
      "Faculty, Art, Media and Technology, Art and Design and History and Theory"
    ],
    "image": "/uploadedImages/Parsons_Paris/Faculty/dominiqueMoulon.jpg",
    "continuingEd": false,
    "noDetail": false,
    "description": "<p>Dominique Moulon studied visual art at the Fine Art School of Bourges and holds a Master's Degree in aesthetics, science and technology of the University of Paris 8. Member of the Observatory of Digital Worlds in Humanities, of the International Association of Art Critics, of the Opline Prize for contemporary art and founder of MediaArtDesign.net, he also writes articles for Digital Mcd, Art Press, The Seen and Neural. He is the Artistic Director of the media art fair Show Off Paris. Dominique Moulon teaches new media at ECV and EPSAA. He has also been a regular guest professor at the School of the Art Institute of Chicago, the National School of Fine Arts in Paris, The Fresnoy and the University of Paris 8.</p><p>His book, <i>Contemporary New Media Art</i>, was published in French by Nouvelles Editions Scala in 2011 and in English as an electronic book in 2013. He is currently doing research at the laboratory Art & Flux (CNRS) of the University of Paris 1 Panthéon-Sorbonne while preparing his next book on the relationship between art, technology and society. As an expert in digital cultures, he is also invited by some companies such as SFR, Accenture, Drouot, Renault, l’Oréal, Google or Axa to give lectures.</p>",
    "links": [
      {
        "label": " MediaArtDesign.net",
        "url": "www.mediaartdesign.net/indexEN.html"
      }
    ]
  },
  {
    "displayName": "Stephanie Nadalo",
    "alphaName": "nadalo",
    "titlePrograms": [
      "Faculty, Art and Design and History and Theory"
    ],
    "image": "/uploadedImages/Parsons_Paris/Faculty/Stephanie-Nadalo-2.jpg",
    "continuingEd": false,
    "noDetail": false,
    "description": "<p>Stephanie Nadalo is a social art historian whose research examines the intersection of material culture, urban history, and pluralism in early modern Europe and the Mediterranean. She holds a PhD and two MA degrees from Northwestern University; she completed her undergraduate studies at Sarah Lawrence College in New York.</p><p>Stephanie's research is published in various academic journals and has benefited from grants including the Fulbright Fellowship to Italy, the American Academy in Rome Prize, and a visiting Fellowship from the Scuola Normale Superiore di Pisa. After several years of research and teaching at institutions in Italy and the United States, she has settled in Paris, France, where she works as a museum educator and teaches in the Art and Design History and Theory department at Parsons Paris, The New School.</p>",
    "links": ""
  },
  {
    "displayName": "Leyla Neri",
    "alphaName": "neri",
    "titlePrograms": [
      "Director, Fashion Design; Strategic Design & Management"
    ],
    "image": "/uploadedImages/Parsons_Paris/Faculty/LeylaNera-2-300.jpg",
    "continuingEd": false,
    "noDetail": false,
    "description": "<p>Leyla Neri is a fashion designer, costume designer, and cultural anthropologist. Following her foundation courses in mathematics and architecture at Ecole Polytechnique Fédérale de Lausanne, she started her career as a set and costume designer while pursuing her studies in fashion design. After her Master of Fine Arts in fashion design in Florence, her first experience in a luxury company took place within the context of the burgeoning heritage center of Gucci.</p><p>She was an independent fashion designer in Milan and Gallarate prior to holding a faculty position in Geneva. She spent five years as professor, head of Product Design Department and director of Fashion Design program at the Geneva School of Art and Design (HEAD) where she developed new curricula following the European Higher Education Bologna Process. She was also the founding director of the Master in Luxury Management at the Geneva School of Business Administration.</p><p>She ran the project that led to the registration of the first dress ever acknowledged as an element of the UNESCO Representative List of Cultural Heritage of Humanity, before completing her Ph.D. in Cultural Anthropology at the Université Lumière in Lyon.</p><p>She joined Parsons Paris as Director of Fashion Design in 2016.</p>",
    "links": ""
  },
  {
    "displayName": "Lila Neutre",
    "alphaName": "neutre",
    "titlePrograms": [
      "Faculty, Fashion Design"
    ],
    "image": "/uploadedImages/Parsons_Paris/Faculty/Neutre_Lila__300x300.jpg",
    "continuingEd": false,
    "noDetail": false,
    "description": "<p>Lila Neutre is a photographer primarily active in the field of contemporary art. Her visual vocabulary refers to fashion photography and pop cultures; her work also focuses on themes such as sexuality, gender and aims to address various social, cultural and political issues. She is currently coordinating the photography PhD program at École Nationale Supérieure de la Photographie (ENSP), involving young artists and researchers.</p><p>Lila Neutre graduated with a creation PhD in both sociology and photography. Her work examines the concepts of identity and self-expression in post-modern societies. Her most recent exhibitions took place in Arles and Liège.</p>",
    "links": [
      {
        "label": "www.lilaneutre.com",
        "url": "http://lilaneutre.com/"
      }
    ]
  },
  {
    "displayName": "Robert Normand",
    "alphaName": "normand",
    "titlePrograms": [
      "Faculty, Fashion Design"
    ],
    "image": "/uploadedImages/Parsons_Paris/Faculty/Normand_Robert__300x300.jpg",
    "continuingEd": false,
    "noDetail": false,
    "description": "<p>Robert Normand is a French interdisciplinary designer. His creative activities range from fashion design to textile design and interior design. He graduated in Fashion Design from Studio Berçot in Paris, before specializing in knitwear. He worked for various French fashion companies among which Hervé Léger, Dorothée Bis, Christophe Lemaire and Lanvin.</p><p>In 1999, he created his own eponymous line of women ready-to-wear, developing unique patterns and prints. This passion for patterns led him to explore the possibilities of translating his artistic skills into a textile collection for interior design. It drove him to acquire expertise in decorative paint and its wide repertoire of materials and motifs. As a result of this broader artistic practice, he also decorates apartments and offices for private clients.</p>",
    "links": [
      {
        "label": "www.robertnormand.com",
        "url": "http://www.robertnormand.com/"
      }
    ]
  },
  {
    "displayName": "Mel O’Callaghan",
    "alphaName": "ocallaghan",
    "titlePrograms": [
      "Faculty, First Year"
    ],
    "image": "/uploadedImages/Parsons_Paris/Faculty/Mel_OCallahan-crop.jpg?n=2773",
    "continuingEd": false,
    "noDetail": false,
    "description": "<p>Mel O’Callaghan is an artist living in Paris since 2007. She works across the mediums of video, performance and installation thematically exploring processual behavior and ritual gesture. In addition to teaching her works have been exhibited in museums and art and video Biennales internationally. She is the current recipient of the PRIX SAM pour l’art contemporain, 2015 and resident at the Cité Internationale des Arts, Paris. In 2016 she was commissioned to present a large-scale performance and installation at the Palais de Tokyo with students and faculty from Parsons Paris; exhibited in L’art de la Revolte, at the Centre Pompidou, Paris; Museum as Performance, Serralves Museum, Porto, Portugal; IAC Institut d’art contemporain , Villeurbanne/Rhône-Alpes, Lyon, France; Centre céramique contemporaine La Borne, France and Les Tanneries Centre d’art contemporain, Amilly. In 2017 she will have solo exhibitions at the Palais de Tokyo in Paris, France and the National Gallery of Victoria, Melbourne, Australia.</p><p>She holds a BA in Visual Art and Science Architecture from The University of Sydney and a Masters of Fine Art Research from The University of New South Wales. Since 2002 Mel has lectured in art, media and technology, design studies, visual communications and interior architecture. She has worked in many exciting and progressive programs such as Design Futures: Creative Technologies; Strategic Design Management; Design Differences: Intercultural Asia and Design Arguments: Making Theories and has been a guest lecturer at The American University of Paris in Museology and Gendered Space.</p><p>She is the co-director of Galerie Allen, Paris.</p>",
    "links": ""
  },
  {
    "displayName": "C. Bridget O’Rourke",
    "alphaName": "orourke",
    "titlePrograms": [
      "Director, Art, Media & Technology and First Year Curriculum"
    ],
    "image": "/uploadedImages/Parsons_Paris/Faculty/Bridget-OROURKE-credit-Ana-Bloom-face-crop.jpg",
    "continuingEd": false,
    "noDetail": false,
    "description": "<p>Bridget O’Rourke is an artist, designer and educator based in Paris. Her teaching focuses on creative process, art and design methodologies and transdisciplinary collaboration. She served as Chair of Foundation (1998-2008) and later Academic Director (2007-2009) for Parsons Paris and Director of Parsons Europe (2010-2013) for Parsons The New School for Design.</p><p>Bridget is an art and design critic and lecturer in schools and creative organizations and a practicing artist whose work is exhibited and published internationally. She is co-director and design consultant for the architecture firm Studio Andrew Todd based in London. She has an MFA from the University of Pennsylvania, a BA in French Literature from the University of Maryland and studied architecture at University of the Arts Philadelphia.</p>",
    "links": ""
  },
  {
    "displayName": "Filipe Pais",
    "alphaName": "pais",
    "titlePrograms": [
      "Faculty, Art, Media & Technology"
    ],
    "image": "/uploadedImages/Parsons_Paris/Faculty/Pais_Filipe_300x300.jpg",
    "continuingEd": false,
    "noDetail": false,
    "description": "<p>Filipe Pais is a lecturer, researcher, curator and artist living in Paris. Filipe has been particularly interested by the ways contemporary art and design movements inquire technological agendas, dealing with issues such as transparency, black boxing, dematerialization, flow, immersion, algorithm politics, ecology and life after google. Besides his activity as a lecturer in the field of interactive media (arts and design) at Noroff University in Norway and at Interface Cultures — Linz Kunstuniversität in Austria, he’s a research associate at the Reflective Interaction group from EnsadLab (the laboratory of ENSAD - École Nationale Supérieure des Arts Decoratifs) in Paris.</p><p>During his doctoral research entitled Experience and Meaning-making Process in Interactive Arts - The influence of play and aesthetic distance in interactive art encounters (UT Austin Portugal, FEUP, University of Porto), Filipe was interested by the aesthetics of play in art experience. After this, he worked as a post-doctoral researcher in the project The Behavior of Things (EnsadLab and University Paris 8) exploring the notion of behavior in objects that are normally inanimate (for example: a door that sighs, or a video camera that refuses to surveille). He was also a student of SPEAP, a Master of Arts and Politics conducted by Bruno Latour and Valérie Pihet at Sciences Po, Paris.</p><p>His artworks have been featured in different art festivals and events in Portugal and abroad. Lately, he curated the exhibitions From Bits to Paper (Le Shadok, Strasbourg) and Re-enter Lisbon (CPAI, Lisboa).</p>",
    "links": ""
  },
  {
    "displayName": "Marco Pecorari",
    "alphaName": "pecorari",
    "titlePrograms": [
      "Assistant Professor and Program Director, MA Fashion Studies"
    ],
    "image": "/uploadedImages/Parsons_Paris/Faculty/marcopecorari-bw.jpg",
    "continuingEd": false,
    "noDetail": false,
    "description": "<p> Dr. Marco Pecorari teaches and conducts research on Fashion History and Theory. He obtained a PhD in Fashion Studies at 'The Centre for Fashion Studies', Stockholm University where he also lectured until 2015. </p><p>His research explores practices of knowledge creation in fashion, particularly looking at the role of archives, exhibitions, performances in the construction of cultural heritage. His monograph <i>Fashion Remains. Rethinking Fashion Ephemera in the Archive</i> is forthcoming with Bloomsbury Academic (2019). Marco has recently published a chapter entitled “Beyond Garments: Reorienting the Practice and Discourse of Fashion Curation” in the book <i>Fashion Curating Critical Practice in the Museum and Beyond</i> (Bloomsbury, 2018) and “Liveness: Performance as a Fashion Curatorial Act&#34; in the book <i>Fashion Curating: Understanding Fashion Through Exhibition</i> (HEAD Publisher, 2017). He also writes about art, design, and fashion for various magazines and journals, and he sits on the editorial board of the scientific journal <i>Fashion Theory. The Journal of Dress, Body &amp; Cultural</i>.</p>",
    "links": [
      {
        "label": "pecorarm@newschool.edu",
        "url": "mailto:pecorarm@newschool.edu "
      }
    ]
  },
  {
    "displayName": "Melissa Rancourt",
    "alphaName": "rancourt",
    "titlePrograms": [
      "Academic Director, Global Executive Masters on Strategic Design + Management"
    ],
    "image": "/uploadedImages/Parsons_Paris/Faculty/MelissaRanourt-bw.jpg",
    "continuingEd": true,
    "noDetail": false,
    "description": "<p>Prior to joining Parsons, Melissa Rancourt taught a wide range of courses in master's, MBA, and executive education programs on subjects including global business strategies, business design  planning, entrepreneurship, operations management, negotiations, project management, communication, e-commerce, international marketing and branding, data-driven decision making, and business statistics. Her educational background includes a Bachelor of Science in Industrial Engineering from Rochester Institute of Technology in New York and an MBA in Entrepreneurship from Babson College as well as creative writing studies in Oxford University.</p><p>Over the past several years, Melissa Rancourt has had the opportunity to address professional audiences as a keynote speaker, conference moderator, and graduation commencement and award presenter on various business and social subjects. She is a two-time TEDx speaker for Brussels and Luxembourg and a United Nations speaker on human rights and has presented at various events of all sizes in Europe, the United States, Brazil, India, and the UAE. In addition, she has appeared on the U.S. TV show <i>Living Abroad</i>, Bloomberg, Euronews and several other media outlets.</p><p>In addition to working at Parsons, Melissa is also a philanthropic entrepreneur who founded an international nonprofit a few years ago to encourage girls around the world to study math and science. The organization now has 1,300 volunteers operating on five continents; it has reached more than 10,000 children and provides university scholarships to children in need.</p><p>Melissa is a dual citizen of Belgium and the United States, Italian-born and of Greek and French heritage. She is an entrepreneur, social activist, engineer, and public speaker. Her expertise is in creating, designing, and developing international businesses.</p>",
    "links": [
      {
        "label": "rancourm@newschool.edu",
        "url": "rancourm@newschool.edu "
      }
    ]
  },
  {
    "displayName": "Claire Richard",
    "alphaName": "richardc",
    "titlePrograms": [
      "Faculty, Art and Design History and Theory"
    ],
    "image": "/uploadedImages/Parsons_Paris/Faculty/CRichard-photo.jpg",
    "continuingEd": false,
    "noDetail": false,
    "description": "<p>Claire Richard is a writer and journalist, focusing on digital cultures and new media. She has worked for Rue89, France Culture, L'Obs, le Crieur, Philosophie Magazine, le Magazine Littéraire. She is an Ecole Normale Supérieure Lettres et Sciences Humaines fellow, and holds an MA in Modern Literature (Ecole des Hautes Etudes en Sciences Sociales). Her thesis on the politics of literature in François Bon and Antoine Volodine has been published as <i>Politiques de la littérature, politiques du lien</i> (éditions des Archives Contemporaines).</p><p>She also holds an MA in Media Culture and Communication from New York University. She has translated various works in human sciences, most notably &quot;Alone Together&quot;, from Sherry Turkle, into French (<i>Seuls Ensemble</i>, éditions de l'Echappée). </p><p>She is also interested in sound. She has created several radio documentaries with Arte Radio, and a radio play &quot;Cent Façons de Disparaître&quot; (5 episodes). She is a founding member of Studiomobile, a sound project inspired by Storycorps - a recording studio where people can come and record each other, for free and for the love of sound and conversation.</p>",
    "links": [
      {
        "label": "<i>Politiques de la littérature, politiques du lien</i>",
        "url": "http://cercc.ens-lyon.fr/spip.php?article229"
      },
      {
        "label": "<i>Seuls Ensemble</i>",
        "url": "https://lectures.revues.org/17697"
      },
      {
        "label": "Studiomobile",
        "url": "https://www.facebook.com/studiomobile2015/"
      }
    ]
  },
  {
    "displayName": "Kathleen Ritter",
    "alphaName": "ritter",
    "titlePrograms": [
      "Faculty, First Year"
    ],
    "image": "/uploadedImages/Parsons_Paris/Faculty/KathleenRitter-300.jpg",
    "continuingEd": false,
    "noDetail": false,
    "description": "<p>Kathleen Ritter is a Canadian artist currently based Paris. She was an artist in residence at La Cité Internationale des Arts, Paris, in 2013, as a recipient of the Canada Council for the Arts International Residencies Program in Visual Arts. Her art practice broadly explores questions of visibility, especially in relation to systems of power, language and technology. Recent exhibitions took place at Access Gallery, Vancouver; G Gallery, Toronto, and Battat Contemporary, Montréal.</p><p>In addition, Ritter has lectured and published on topics in contemporary art nationally and internationally, with texts appearing in numerous catalogues and journals, including ESSE, Open Letter, C Magazine, Prefix Photo, and Fillip. She written on the work of Mark Manders, Pierre Huyghe, Althea Thauberger, Colette Urban, Rachel Harrison, Derek Sullivan, Ian Wallace and Ai Weiwei, to name a few, and on subjects as diverse as hip hop, precarious labour, public art, revolution and visual perception.</p>",
    "links": ""
  },
  {
    "displayName": "Evan Roth",
    "alphaName": "roth",
    "titlePrograms": [
      "Faculty, Art, Media and Technology"
    ],
    "image": "/uploadedImages/Parsons_Paris/Faculty/evanroth-bw.gif",
    "continuingEd": false,
    "noDetail": false,
    "description": "<p>Evan Roth is an American artist based in Paris whose practice visualizes and archives culture through unintended uses of technologies. Creating prints, sculptures, videos and websites, his work explores the relationship between misuse and empowerment and the effect that philosophies from hacker communities can have when applied to digital and non-digital systems.</p><p>Roth's work is in the permanent collection of the Museum of Modern Art NYC and has been exhibited at various institutions, including the Centre Pompidou, the Kunsthalle Wien, the Tate and the front page of Youtube. He has received numerous awards, including the Golden Nica from Prix Ars Electronica, Rhizome/The New Museum commissions and the Smithsonian's Cooper-Hewitt National Design Award.</p><p>Roth also co-founded the arts organizations Graffiti Research Lab and the Free Art & Technology Lab.</p>",
    "links": ""
  },
  {
    "displayName": "Mathilde Roussel",
    "alphaName": "roussel",
    "titlePrograms": [
      "Faculty, First Year"
    ],
    "image": "/uploadedImages/Parsons_Paris/Faculty/mathilde-roussel-300.jpg",
    "continuingEd": false,
    "noDetail": false,
    "description": "<p>Mathilde Roussel is a French artist based in Paris. Through her practice in drawing, sculpture and installations, she tries to register the transformations of our body through time and to understand how it adapts to the environment. Mathilde Roussel has been invited as visiting artist and guest critic at the University of Iowa (US); Watkins College of Art (Nashville, US); ESAG Penninghen (Paris) ; Académie Charpentier (Paris) and Ecole Duperré (Paris).</p><p>Recent exhibitions include solo exhibitions at Pioneer Works (Brooklyn, NY); the Invisible Dog Art Center (Brooklyn, NY); Galerie du Haut Pavé (Paris); Cheekwood Botanical Garden & Museum of Art (Nashville, US) as well as group exhibitions at Museum of Brou (France); Villa Belleville / Point Ephémère (Paris); Museum Rijswijk (The Hague); Triennale Design Museum (Milan).</p>",
    "links": [
      {
        "label": "mathilderoussel.com",
        "url": "http://www.mathilderoussel.com/"
      }
    ]
  },
  {
    "displayName": "Katharina Sand",
    "alphaName": "sand",
    "titlePrograms": [
      "Faculty, Strategic Design & Management"
    ],
    "image": "/uploadedImages/Parsons_Paris/Faculty/Sand_Katharina__300x300.jpg",
    "continuingEd": false,
    "noDetail": false,
    "description": "<p>Katharina Sand is a fashion entrepreneur, editor and lecturer. In her work as the CEO/founder of the designer boutique SEPTIEME ETAGE, she has curated designers and events for over 18 years and explored and developed shifts in retail, marketing, and the impact of technology on the industry.</p><p>She has participated as a speaker on Fashion and Technology at Tedx Transmedia in Rome in September 2013 and has participated in a wide variety of fashion award juries. She is a regular lecturer for the Geneva University of Art and Design (HEAD), the Masters of Luxury at the Geneva Business University (HEG), as well as PARSONS Paris. She has covered fashion, art and design as Senior Contributing Editor for the Swiss edition of L'OFFICIEL , as fashion editor for &quot;Bliss&quot; ( the magazine of the Swiss financial daily AGEFI), has contributed to a variety of publications including PAPER Magazine, and currently serves as the Shopping & Style and Art & Culture editor for Time Out Switzerland.</p>",
    "links": [
      {
        "label": "www.septieme.com/pages/pres",
        "url": "https://www.septieme.com/pages/press"
      }
    ]
  },
  {
    "displayName": "Jerome Saint-Clair",
    "alphaName": "saint-clair",
    "titlePrograms": [
      "Faculty, Art, Media and Technology"
    ],
    "image": "/uploadedImages/Parsons_Paris/Faculty/JeromeSaintClair-bw-200.jpg",
    "continuingEd": false,
    "noDetail": false,
    "description": "<p>Jerome Saint-Clair is a French artist and engineer working mainly in the field of new media. His artwork includes computer based generative systems, interactive installations, software libraries, but also drawings and computer-free installations or objects. His recent work focus on graffiti and also the permeability between the digital and the physical worlds. He initiated the creation of the French branch of the Graffiti Research Lab.</p>",
    "links": ""
  },
  {
    "displayName": "Emily Song",
    "alphaName": "song",
    "titlePrograms": [
      "Faculty, Strategic Design & Management"
    ],
    "image": "/uploadedImages/Parsons_Paris/Faculty/Song_Emily_300x300.jpg",
    "continuingEd": false,
    "noDetail": false,
    "description": "<p>Emily Song has over 20 years of business experience holding key positions in accounting, finance and business development. Her business background includes experience as a financial controller with investment bank ING Barings, an accounting and finance manager at Nautilus Biotech and a business developer with Winstar communication.</p><p>She is the founder of LUXE & EM, S.A.S, a company based in Paris, offers carefully selected authenticated luxury items. She holds a MBA in international business from Ecole Nationale des Ponts et Chaussées, Paris, France and she holds PhD ABD from International School of Management.</p><p>Professor Song is visiting professor at Ecole Nationale des Ponts et Chaussés, visiting professor at American Business School Paris, IEMI International Business School and visiting professor at INSEEC, Geneva, Switzerland. She teaches MBA and Executive MBA courses including Financial Accounting, Managerial Accounting, Financial Management, Business Finance, Entrepreneurial Financing, Writing Business Plans and Management Control.</p>",
    "links": ""
  },
  {
    "displayName": "Chris Sugrue",
    "alphaName": "sugrue",
    "titlePrograms": [
      "Faculty, Art, Media and Technology"
    ],
    "image": "/uploadedImages/Parsons_Paris/Faculty/chrisSugrue.jpg",
    "continuingEd": false,
    "noDetail": false,
    "description": "<p>Chris Sugrue is an artist and programmer developing interactive installations, audio-visual performances and experimental interfaces. Her works experiment with technology in playful and curious ways and investigate topics such as artificial life, eye-tracking and optical illusions. She has exhibited internationally in such festivals and galleries as Ars Electronica, Sónar Festival, Pixel Gallery, Medialab-Prado, Matadero Madrid, and La Noche En Blanco Madrid.</p><p>Sugrue’s interactive installation, <i>Delicate Boundaries</i> received an honorary mention from Vida Art and Artificial Life Awards and first prize from Share Festival. In 2009, she collaborated to help develop the EyeWriter, a low-cost eye controlled drawing tool for ALS patients. The EyeWriter was honored with Design of the Year award for interactive category, the Future Everything Award, and a Golden Nica from Ars Electronica.</p><p>Sugrue holds a Masters of Fine Arts in Design and Technology from Parsons School of Design. She has worked as a creative engineer at the Ars Electronica Futurelab where she was the lead interaction developer for a stereoscopic interactive dance performance with artist and choreographer Klaus Obermaier. Sugrue was the recipient of a year-long fellowship at the Eyebeam Art and Technology Center in New York, and has held artist residencies with Hangar in Barcelona, La Casa De Velázquez in Madrid and Harvestworks in New York. She has taught courses in the Design and Technology department at Parsons School of Design, the Interface Culture program at the KunstUniversität in Linz, Austria, and numerous workshops on visual and creative programming.</p>",
    "links": [
      {
        "label": "Delicate Boundaries",
        "url": "http://csugrue.com/delicateboundaries"
      },
      {
        "label": "EyeWriter",
        "url": "http://eyewriter.org"
      }
    ]
  },
  {
    "displayName": "Damian Yee",
    "alphaName": "yee",
    "titlePrograms": [
      "Faculty, Fashion Design"
    ],
    "image": "/uploadedImages/Parsons_Paris/Faculty/Damian_Yee-crop.jpg",
    "continuingEd": false,
    "noDetail": false,
    "description": "<p>Born and raised as a child in Jamaica. My fashion sense arose while still in high school in Toronto, Canada; which led to studying fashion at Ryerson University and a BA in Applied Arts. In my final year, I won a finalist place in the Jeune Createurs de la Mode Paris competition that confirmed that Paris was the City of Lights for me. And thus, after finding a position at Martine Sitbon, my fashion career started. Martin Sitbon and her close collaboration with her husband, Art director Mark Ascoli taught me the entire creative processes from inspiration, to sketches, to fittings, to fashion show, to photo styling the shooting for the ad campaign. This was a quality that Karl Lagerfeld appreciated, and I was included not only in the studio, but also working on his other photographic projects for magazines.</p><p>At Guy Laroche, as Artistic Director, is what we aim to achieve from school. The years of experience finally take form. The ethereal dream of creating and showing your collection is both exhilarating and anxious. Now finding myself, sharing and instructing these principles, bring me back to the spark of why I love fashion, with its ever changing moods but its constant desire for the new, and most of all, sharing in the dream.</p>",
    "links": ""
  }
]