[
  {
    "description": "<p>Award winning artist and educator, Austin G. Casebolt was born in the heart of the Appalachian mountains in Pikeville, Kentucky. Casebolt is currently based in New York where he is a graduate student in the Parsons, MFA Fine Arts program at The New School (TNS). Since graduating from Morehead State University with a Bachelors in Fine Arts and Teaching, he brought high-level technical skills training and a creative spirit to the community in Owensboro, Kentucky. Casebolt has relentlessly pursued his passion for social justice and improving accessibility to art and educational resources through public art installations, leading nonprofit organizations, and educating students in the public school system. Casebolt will be continuing this mission during a Teaching Assistantship at TNS. </p><p>Currently, Casebolt is also working as a frontline worker in COVID-19 Response and Support with Housing and Residential Education. He has been part of a team that has welcomed students from across the globe to the TNS community by helping alleviate stress, provide security, distribute critical information, and respond within minutes to needs or difficulties during the global pandemic.</p><p>Casebolt is committed to developing the formal, intellectual and conceptual aspects of his artistic practice. During his time in the Parsons, MFA Fine Arts program he is focused on developing a rigorous interdisciplinary practice that combines studio and theory that will enable him to continue a diverse studio practice to further his abiding commitment of advocating for the public good and improving accessibility to art and educational resources.</p><p>Casebolt has joined the ranks of leaders who envision and chart a course for the future at The New School as a member of the Board of Trustees.</p> ",
    "link": "",
    "position": "",
    "image": "https://s3.amazonaws.com/tns-assets/Media/Resources/Content/About_New/University_Leadership/A_Casebolt_800x800.jpg",
    "name": "Austin G. Casebolt",
    "lastName": "Casebolt",
    "title": "MFA Candidate, Parsons School of Design"
  },
  {
    "description": "<p><b id=\"docs-internal-guid-3d56adf0-7fff-0072-3c76-07984bc412d1\"></b></p><p dir=\"ltr\"><span style=\"font-size: 11pt;vertical-align: baseline;\">Ted Goldthorpe is a partner and the head of Credit at BC Partners, a firm he joined in 2017. He is also a member of the Private Equity Investment Committee.</span></p><p dir=\"ltr\"><span style=\"font-size: 11pt;vertical-align: baseline;\">Mr. Goldthorpe earlier served as the president of Apollo Investment Corporation, chief investment officer at Apollo Investment Management, and senior portfolio manager at U.S. Opportunistic Credit. After joining Apollo in  2012, he oversaw the Opportunistic Credit platform, aggregating more than $20 billion in assets under management during his tenure. His most recent focus was the direct origination business. Mr. Goldthorpe was named to the firm’s Senior Management Committee in 2014.</span></p><p dir=\"ltr\"><span style=\"font-size: 11pt;vertical-align: baseline;\">Previously Mr. Goldthorpe was employed by Goldman Sachs &amp; Co., beginning in 1999. He first worked in the high yield distressed business, the Merchant Banking Division, and the Investment Banking Division. Mr. Goldthorpe next served as managing director of the Special Situations Group, running both the middle market private equity business and the Canadian business (CSSG). He then ran the Bank Loan and Distressed Investing Desk.</span></p><p dir=\"ltr\"><span style=\"font-size: 11pt;vertical-align: baseline;\">Mr. Goldthorpe has served on the boards of SPARTA Insurance Holdings, Inc., Flatiron Re, JHT Holdings, Baxa Healthcare, Shelter Bay, Fairway Energy, and other firms and was a board observer for First Solar and other companies. He currently serves on the board of Crescent Point Energy, BC Partners Lending Corporation, Mount Logan Capital, and Portman Ridge Corporation.</span></p><p dir=\"ltr\"><span style=\"font-size: 11pt;vertical-align: baseline;\">Mr. Goldthorpe received a BA in Commerce from Queen's University in Kingston, Ontario. He is a frequent guest lecturer at leading universities including Columbia University, the University of Pennsylvania (Wharton), the University of Virginia, New York University, Queen's University, and Stanford University. He serves on the Global Advisory Board of the Smith School of Business at Queen's University and on the boards of the Canadian Olympic Foundation, HerJustice, and Capitalize for Kids.</span></p> ",
    "name": "Ted Goldthorpe",
    "lastName": "Goldthorpe",
    "lifeTrustee": false,
    "noDetail": false,
    "link": "",
    "position": "",
    "image": "https://s3.amazonaws.com/tns-assets/Media/Resources/Content/About_New/University_Leadership/Ted_Goldthorpe_bio.jpg",
    "title": "Partner and Head of Credit, BC Partners"
  },
  {
    "name": "Linda E. Rappaport",
    "title": "Of Counsel, Shearman and Sterling, LLP",
    "lastName": "Rappaport",
    "position": "Chair",
    "image": "/edu-assets/leadership/img/Rappaport-Linda-preferred.jpg",
    "lifeTrustee": false,
    "noDetail": false,
    "description": "<p>Linda Rappaport is Of Counsel at Shearman &amp; Sterling LLP in New York City. She is a former practice group leader of the Compensation, Governance &amp; ERISA/Private Client Group as well as a founding member of the firm’s Corporate Governance Advisory Group. Her practice focuses on all aspects of executive compensation and benefits, including corporate, securities, and tax laws and related corporate governance and regulatory matters. She has broad experience in the design and implementation of executive incentive programs and in the negotiation and preparation of executive employment contracts and severance arrangements, with an emphasis on the financial services and entertainment industries.  Her practice also encompasses all compensation, benefits, and related governance issues associated with corporate acquisitions, divestitures, public offerings, restructurings, and bankruptcies. </p><p>Ms. Rappaport has a special focus on the representation of global, U.S., and non-U.S. companies and their boards of directors and compensation committees in corporate governance matters, including CEO succession, public disclosure, and executive compensation. She also represents individual executives of public companies and private enterprises.</p><p>Active in lecturing, Ms. Rappaport is the author of numerous articles on a variety of corporate governance and executive compensation issues. She has been ranked Band 1 for Employee Benefits &amp; Executive Compensation: New York in <i>Chambers USA </i>since 2007.</p><p>Ms. Rappaport became a partner of Shearman &amp; Sterling in 1985. She has served three terms as an elected member of the firm’s Policy Committee through 2014 and has been a member of the firm’s Executive Group. She is also a founding member and advisor of the firm’s Women’s Initiative For Success, Excellence and Retention (WISER) and a member of its Diversity Committee and the firm’s Hiring Partner. Before joining the firm in 1979, she served as a law clerk to Chief Judge James S. Holden, U.S. District Court of the District of Vermont, from 1978 to 1979.</p>",
    "link": ""
  },
  {
    "name": "Craig A. Bernecker",
    "lastName": "Bernecker",
    "title": "Director and Professor, MFA Lighting Design Program,<br>Parsons School of Design",
    "position": "",
    "image": "https://s3.amazonaws.com/tns-assets/Media/Resources/Content/About_New/University_Leadership/Craig_Bernecker.jpg",
    "lifeTrustee": false,
    "noDetail": false,
    "description": "<p>Craig Bernecker is the director of and an associate professor in the School of Constructed Environments' MFA Lighting Design program at Parsons School of Design. Dr. Bernecker is also founder of The Lighting Education Institute (LEI), an educational initiative focusing on lighting education for professionals in the lighting and buildings industry. He has taught in the Graduate Architecture program at the University of Pennsylvania and played a major role in the creation of a &ldquo;Lighting Diploma&rdquo; at the Ibero-American University in Mexico City.</p><p>From 1981 through 1999, he directed the lighting education program in the Department of Architectural Engineering at Penn State University. While at Penn State, Dr. Bernecker also developed a number of continuing and distance education lighting programs and served on the major policy-advising body for the university&rsquo;s online campus, Penn State World Campus. He has published more than 50 articles on research and education in lighting design and illumination engineering and is known for his work on the psychological aspects of lighting. In addition to his educational and research activities, he has maintained an active consulting practice, providing lighting design services and acting as an expert consultant on many projects and as an expert witness in many legal cases. He regularly serves as a peer reviewer for lighting research proposals and projects sponsored by the U.S. Department of Energy.</p><p>Dr. Bernecker has also served the Illuminating Engineering Society of North America (IESNA) in multiple capacities, including president for 2004–2005. His contributions to lighting education led IESNA to name him a fellow in 1991, and he received the Distinguished Service Award in 2017 for his service to the organization. Dr. Bernecker holds a PhD in Psychology and a Master of Science in Architectural Engineering from Penn State.</p>",
    "link": ""
  },
  {
    "name": "Franci J. Blassberg",
    "lastName": "Blassberg",
    "title": "Of Counsel,<br>Debevoise & Plimpton, LLP",
    "position": "Vice Chair",
    "image": "/edu-assets/leadership/img/Blassberg-Franci.jpg",
    "lifeTrustee": false,
    "noDetail": false,
    "description": "<p>Ms. Blassberg recently retired as a partner after a 35-year career with Debevoise & Plimpton, where she is currently of counsel. She spent much of her legal career advising private equity clients. Since her retirement, she has been teaching courses in private equity and corporate governance at Cornell Law School and Berkeley Law School. </p><p>A skilled negotiator of complex transactions, Ms. Blassberg was named by the National Law Journal one of the 50 Most Influential Women Lawyers in America (2007) and one of the 100 Most Influential Lawyers in America (2006). Ms. Blassberg has also been recognized by <a href='http://www.debevoise.com/methodology/'>Private Equity International</a> as one of the 30 most influential lawyers in global private equity. She is a trustee of the New-York Historical Society and a trustee emerita at Cornell University and served as a board member of the New York City Ballet. She is on the boards of The Lazard Funds, Inc., and other funds managed by Lazard Asset Management and its affiliates.</p>",
    "link": "http://www.debevoise.com/franciblassberg"
  },
  {
    "name": "Steven H. Bloom",
    "lastName": "Bloom",
    "title": "",
    "position": "",
    "image": "/edu-assets/leadership/img/Bloom-Steven.jpg",
    "lifeTrustee": false,
    "noDetail": false,
    "description": "<p>Mr. Bloom, CFA, has more than 30 years of experience in the alternative asset management business. He is currently managing his family investment office and is engaged in an advisory capacity with several hedge funds. In 1983, he was one of five founding partners of Susquehanna International Group, a global proprietary trading firm, and in 1999, he founded and managed Sagamore Hill Capital Management, a multi-billion-dollar multistrategy hedge fund. He worked as an environmental scientist at the Natural Resources Defense Council for several years before entering the investment field.</p><p>Mr. Bloom is chairman of the Binghamton University Foundation and is a member of the Dean’s Advisory Board at the University of the Michigan School of Public Health where he is active with social entrepreneurship initiatives. Mr. Bloom was awarded an honorary Doctor of Humane Letters degree from the State University of New York.</p>",
    "link": ""
  },
  {
    "name": "Dominique Bluhdorn",
    "lastName": "Bluhdorn",
    "title": "President,<br>The Altos de Chavon Cultural Center Foundation",
    "position": "",
    "image": "/edu-assets/leadership/img/Bluhdorn-Dominique.jpg",
    "lifeTrustee": false,
    "noDetail": false,
    "description": "<p>Ms. Bluhdorn established the Altos de Chavón Cultural Center Foundation in the Dominican Republic, with the mission of creating and supporting a multifaceted arts community that encompasses the visual and performing arts, craft workshops, an artist-in-residence program that also serves as the Caribbean site for the Davidoff Arts Initiative, an archaeological museum, and teaching programs in design and visual arts.</p><p>At the center of the Cultural Center Foundation is the Altos de Chavón School of Design, with campuses in La Romana and Santo Domingo. Since its establishment in 1983 the school has been affiliated with Parsons. This two-year, university-level school has graduated nearly 3,000 students, many of whom now hold distinguished creative positions in fashion, graphic design, digital design, fine arts, and illustration around the world.</p><p>Ms. Bluhdorn is a member of the Davidoff Art Initiative Advisory Council. She has served on the boards of the Corcoran Gallery in Washington, DC, and the New York Academy of Art.</p>",
    "link": ""
  },
  {
    "name": "Christopher J. Castano",
    "lastName": "Castano",
    "title": "Managing Director,<br>Grosvenor Capital Management, LP",
    "position": "",
    "image": "/edu-assets/leadership/img/Castano-Chris.jpg",
    "lifeTrustee": false,
    "noDetail": false,
    "description": "<p>Mr. Castano received his Bachelor of Arts from Villanova University and his Juris Doctorate from Seton Hall University. He is an alumnus of the Regis High School in New York City.</p><p>Mr. Castano joined Grosvenor Capital Management as a managing director in 2010 and currently shares responsibility for business development. Before working at Grosvenor Capital Management, he served as head of business development at Sonar Capital Management, a long/short equity hedge fund. From 2001 to 2009, he held a number of positions at Merrill Lynch, including head of high net worth sales for alternative investments, head of the product platform for the Private Banking group, and head of private equity origination for the Private Client group. Mr. Castano served as a consultant at Square Foot, which specializes in managing urban revitalization and renovation projects. During that time, he also served as the associate director of the Downtown Newark business improvement district (BID). From 1995 to 1999, he was an attorney at Waters, McPherson, McNeill, P.C., which specializes in environmental litigation and urban redevelopment. Mr. Castano currently serves on the Advisory Board for the Dominican Sisters of Caldwell. Mr. Castano joined the board of the Schools of Public Engagement in 2012.</p>",
    "link": ""
  },
  {
    "name": "Jane DeFlorio",
    "lastName": "DeFlorio",
    "title": "Retired Managing Director, Deutsche Bank",
    "position": "",
    "image": "/edu-assets/leadership/img/DeFlorio-Jane.jpg",
    "lifeTrustee": false,
    "noDetail": false,
    "description": "<p>After a successful 16-year career providing financial advice to the world’s most notable apparel and retail companies, Ms. DeFlorio retired in December 2013 as a managing director at Deutsche Bank in New York. At Deutsche Bank, Ms. DeFlorio headed coverage of the U.S. retail industry sector. Her clients included The TJX Companies, Home Depot, and Nike. Ms. DeFlorio joined Deutsche Bank in April 2007 from UBS Investment Bank, where she worked on consumer sector transactions.</p><p>Ms. DeFlorio’s current focus is serving on public company boards, private investing, and philanthropy. She is a director of DDR Corp (NYSE:DDR), an $11 billion real estate investment trust that owns and manages value-oriented open-air retail shopping centers, or “power centers,” on the U.S. mainland and in Puerto Rico. She is currently the lead independent director at Perry Ellis International (NASDAQ:PERY), a $350 million apparel wholesaler and retailer, where she serves on the Audit, Nominating and Investment Committees. In addition to serving on The New School’s Board of Trustees, Ms. DeFlorio serves on the Parsons Board of Governors. </p>",
    "link": ""
  },
  {
    "name": "Douglas D. Durst",
    "lastName": "Durst",
    "title": "Chairman,<br>The Durst Organization",
    "position": "",
    "image": "/edu-assets/leadership/img/Durst-Douglas.jpg",
    "lifeTrustee": false,
    "noDetail": false,
    "description": "<p>Mr. Durst is the chairman of the Durst Organization, one of Manhattan’s top real estate development companies and a leader in developing environmentally friendly buildings. Mr. Durst is also a noted philanthropist and serves on the boards of several New York City organizations, including the Trust for Public Land and the Roundabout Theater Company. He is a director of the Real Estate Board of New York and a trustee of The Old York Foundation, which is committed to helping people understand the history of and issues facing New York City. Mr. Durst carries on his family’s long tradition of involvement with The New School—his grandmother Rose Friedwald Durst was an art student at The New School, and his grandfather Joseph and father, Seymour, were both contributors and volunteers.</p>",
    "link": "http://www.durst.org"
  },
  {
    "name": "Susan L. Foote",
    "lastName": "Foote",
    "title": "",
    "position": "Vice Chair",
    "image": "https://s3.amazonaws.com/tns-assets/Media/NewSchooledu/About/University_Leadership/SusanFoote.jpeg",
    "lifeTrustee": false,
    "noDetail": true,
    "description": "",
    "link": ""
  },
  {
    "name": "Nancye Green",
    "lastName": "Green",
    "title": "Chief Design Officer,<br>The Medicines Company",
    "position": "",
    "image": "/edu-assets/leadership/img/Green-Nancye.jpg",
    "lifeTrustee": false,
    "noDetail": false,
    "description": "<p>Nancye Green is a designer, with a storied career addressing the strategies and complex communication challenges of large enterprises, startup companies and non-profit organizations. Nancye founded the design firm Donovan/Green with Michael Donovan. They designed and produced in multiple media for clients as diverse as Hoffman-La Roche, 3M, GM, P&G, Exxon, President Ronald Reagan, American Express, Sony and American Girl. After selling their firm, she served as CEO of Waterworks and on the Boards of Directors of several companies including Hallmark and Waterworks. She is currently Chief Design Officer of The Medicines Company. She is a past President of both the American Institute of Graphic Arts, receiving its Gold Medal with Donovan, and the International Design Conference in Aspen, and is currently Vice Chairman of the Board of EcoHealth Alliance. She holds degrees from Tulane University in Political Science and Parsons School of Design in Environmental Design, graduating as valedictorian, and was awarded an Honorary Doctorate from The Corcoran School of Art.</p>",
    "link": ""
  },
  {
    "name": "Joseph R. Gromek",
    "lastName": "Gromek",
    "title": "Retired President and CEO,<br>The Warnaco Group, Inc.",
    "position": "",
    "image": "/edu-assets/leadership/img/Gromek-Joseph.jpg",
    "lifeTrustee": false,
    "noDetail": false,
    "description": "<p>Mr. Gromek is the retired president and CEO of the Warnaco Group and is now a retail and apparel consultant. Mr. Gromek has received a number of awards for his contributions to the apparel field and for his philanthropic work.</p><p>He is currently a director on the boards of Children’s Place, Guess?, Inc., the Stanley M. Proctor Company, Hudson Executive Capital, the Baker Retail Center at Wharton, and Wolverine World Wide.   In addition to serving as chairman of the Board of Trustees of The New School, Mr. Gromek is also a member of the Board of Directors of The Ronald McDonald House of New York and a member of the St. Peter’s University Board of Trustees. Mr. Gromek’s commitment to the fashion industry led him to serve on the Board of Governors of Parsons School of Design.</p>",
    "link": ""
  },
  {
    "name": "Jeffrey Gural",
    "lastName": "Gural",
    "title": "Chairman,<br>Newmark Grubb Knight Frank",
    "position": "",
    "image": "/edu-assets/leadership/img/Gural-Jeff.jpg",
    "lifeTrustee": false,
    "noDetail": false,
    "description": "<p>Mr. Gural is chairman of Newmark Family Properties, a commercial real estate firm currently managing 41 buildings in the metropolitan area, in which he maintains an ownership interest. He is also the owner of Tioga Downs Casino and Vernon Downs Casino, the president of American Racing and Entertainment, and the operator of the New Meadowlands Racetrack. He has received numerous awards for his philanthropic work in New York City and serves on the boards of several charitable organizations, including the Museum at Eldridge Street, the March of Dimes, the Alliance of Resident Theatres/New York, the Jewish Community Center of Manhattan, Outward Bound New York City, and the Settlement Housing Fund. He is the president of the Starlight Children’s Foundation in New York, the chairman of the I Have A Dream Foundation - NY, and a trustee of Cooper Union. He is also a director of the Real Estate Board of New York. Mr. Gural was introduced to The New School by life trustee Eugene Lang.</p>",
    "link": "http://www.ngkf.com"
  },
  {
    "name": "Susan U. Halpern MA '76",
    "lastName": "Halpern",
    "title": "President, The Sirus Fund",
    "position": "",
    "image": "/edu-assets/leadership/img/Halpern-Susan.jpg",
    "lifeTrustee": false,
    "noDetail": false,
    "description": "<p>Ms. Halpern is the president of the Sirus Fund, a foundation that supports programs for needy children and their families. She is also an attorney specializing in legal issues associated with adoption and foster parenting.</p>",
    "link": ""
  },
  {
    "name": "William E. Havemeyer",
    "lastName": "Havemeyer",
    "title": "President, Havemeyer Management Services, Inc.",
    "position": "",
    "image": "/edu-assets/leadership/img/Havemeyer-William.jpg",
    "lifeTrustee": false,
    "noDetail": false,
    "description": "<p>Mr. Havemeyer is president of Havemeyer Management Services, Inc., a consulting firm that specializes in urban planning and downtown revitalization as well as nonprofit organizational management and governance. He currently serves as the part-time COO of the Skyscraper Museum in New York City and also chairs the board of the New York City Cultural Institutions Retirement System, a $1.63 billion pension fund. He recently completed 20 years as a trustee of Union Theological Seminary in New York City and was also a long-standing member of the board of the Brooklyn Museum. Mr. Havemeyer received The New School’s Distinguished Service Award in 1994 and served as interim director of the Parsons Paris program in 1995–1996.</p><p>Mr. Havemeyer’s long involvement with historic real estate restoration helped him lead The New School’s Buildings and Grounds Committee’s work on the Greenwich Village campus for many years. Mr. Havemeyer appreciates the university’s focus on urban and progressive issues.</p>",
    "link": ""
  },
  {
    "name": "Sheila C. Johnson",
    "lastName": "Johnson",
    "title": "Founder and CEO,<br>Salamander Hospitality",
    "position": "",
    "image": "/edu-assets/leadership/img/Johnson-Sheila-C.jpg",
    "lifeTrustee": false,
    "noDetail": false,
    "description": "<p>Ms. Johnson oversees a growing portfolio of luxury properties as founder and CEO of Salamander Hotels and Resorts. The equestrian-inspired and luxurious Salamander Resort & Spa in Middleburg, Virginia, had its much-anticipated opening in August 2013, which was recognized by USA Today as among the world’s top eight hotel openings of 2013.</p><p>Vice chairman of Monumental Sports & Entertainment and president and managing partner of the WNBA’s Washington Mystics, Ms. Johnson also serves on the Executive Committee of the United States Golf Association. She is a partner in ProJet Aviation, an aircraft management and charter company, and in Mistral, the makers of fine bath, body, and home products. In November 2012, Ms. Johnson launched her own collection of luxury scarves, inspired by travels around the world and manufactured in Italy.</p><p>Ms. Johnson was a founding partner of Black Entertainment Television and is a producer of documentary and feature films. She supports the arts and education as a board member of Parsons School of Design, serves on the board of the ANNIKA Foundation, and is also a member of the Leadership Council at Harvard Kennedy School’s Center for Public Leadership.</p>",
    "link": "http://www.salamanderhotels.com"
  },
  {
    "name": "Michael J. Johnston",
    "lastName": "Johnston",
    "title": "Retired Executive Vice President, The Capital Group Companies, Inc.",
    "position": "",
    "image": "/edu-assets/leadership/img/michael-johnson.jpg",
    "lifeTrustee": false,
    "noDetail": false,
    "description": "<p>Mr. Johnston retired as the executive vice president of The Capital Group Companies in 2009. Before joining Capital Group, he served as president of Paine Webber Capital Markets. A chair emeritus of The New School, Mr. Johnston is a trustee and former chair of the board of Claremont Graduate University and a trustee of both Union Theological Seminary and the Schumann Center for Media and Democracy. He also serves on the Solutions Council for the Rocky Mountain Institute and the national advisory council of the Harry S Truman Library institute. Mr. Johnston was drawn to The New School because of its commitment to excellence in progressive higher education.</p>",
    "link": "http://www.thecapitalgroup.com"
  },
  {
    "name": "Bevis Longstreth",
    "lastName": "Longstreth",
    "title": "Retired Partner,<br>Debevoise & Plimpton LLP",
    "position": "",
    "image": "/edu-assets/leadership/img/longstreth-bevis.jpg",
    "lifeTrustee": false,
    "noDetail": false,
    "description": "<p>In 1993, Mr. Longstreth retired as a senior partner of the New York City law firm Debevoise & Plimpton to pursue other interests, including writing. Mr. Longstreth has always been attracted to teaching and values its role in democracies. Upon retiring, he served as a full-time adjunct professor at Columbia Law School, where he had taught a seminar for six years. He has published three historical novels. During his professional career, he has often spoken and written on finance, corporate behavior, and the law. Mr. Longstreth has served on many boards of directors, including those of TIAA/CREF, Invesco, GMO, and the Center for Public Integrity. Currently he is a member of the finance committee of the Rockefeller Family Fund and an adviser to MDRC and the Kentucky Teachers’ Retirement System.</p>",
    "link": "http://www.debevoise.com/bevislongstreth?tab=Biography"
  },
  {
    "name": "Anthony Mannarino<br>BA '81, MA '83",
    "lastName": "Mannarino",
    "title": "Executive Vice President, <br>Extell Development Company",
    "position": "",
    "image": "/edu-assets/leadership/img/Mannarino-Anthony.jpg",
    "lifeTrustee": false,
    "noDetail": false,
    "description": "<p>Mr. Mannarino is executive vice president of Extell Development Company, where he oversees the firm’s extensive real estate portfolio of residential, office, hotel, and mixed-use projects. Extell is one of New York City’s most active developers and has owned and developed a portfolio of more than 20 million square feet. Before joining the Extell team, Mr. Mannarino served as managing director at Tishman Speyer, where he was responsible for development and new business initiatives in the New York region. Previously he was managing partner of Sony Center, a 1.3 million-square-foot mixed-use development in Berlin, Germany. Before joining Tishman Speyer, he served as the acting president of the New York City Economic Development Corporation, the city’s primary agency for economic development, business growth, and retention. He also served as the executive director of the New York City Industrial Development Authority. </p><p>In addition to his involvement at The New School, Mr. Mannarino is a Trustee of the Citizens Budget Commission and a member of its Executive Committee. He also serves on the boards of the New York Building Congress, the NYU Furman Center, and the ACE Mentor Program. Mr. Mannarino is a member of REBNY and its Economic Development Committee. He has taught at the NYU Schack Institute of Real Estate and Columbia University’s Graduate School of Architecture, Planning and Preservation.</p>",
    "link": ""
  },
  {
    "name": "Dwight A. McBride",
    "lastName": "McBride",
    "title": "President, The New School",
    "position": "",
    "image": "/edu-assets/leadership/img/Dwight_McBride.jpg",
    "lifeTrustee": false,
    "noDetail": false,
    "description": "<p>Dr. Dwight A. McBride became The New School’s ninth president on April 16, 2020. With nearly three decades in higher education, Dr. McBride is an experienced leader, accomplished educator, and author. Prior to his appointment at The New School, he was the provost and executive vice president for Academic Affairs at Emory University, where he also held the position of Asa Griggs Candler Professor of African American Studies, Distinguished Affiliated Professor of English, and associated faculty in Women’s, Gender, and Sexuality Studies. Dr. McBride previously served at Northwestern University as the dean of The Graduate School, associate provost for Graduate Education, and Daniel Hale Williams Professor of African American Studies, English, and Performance Studies. Earlier he served as dean of the College of Liberal Arts & Sciences at the University of Illinois at Chicago and on the faculty of the University of Pittsburgh. </p><p>A leading scholar of race and literary studies, Dr. McBride has published award-winning books, essays, articles, and edited volumes that examine connections between race theory, black studies, and identity politics. He received his AB in English with a certificate in African American Studies from Princeton University and his MA and PhD in English from the University of California, Los Angeles.</p>",
    "link": "http://www.newschool.edu/university-president/"
  },
  {
    "name": "Daniel T. Motulsky",
    "lastName": "Motulsky",
    "title": "Managing Director,<br>Moelis & Company",
    "position": "",
    "image": "/edu-assets/leadership/img/Motulsky-Dan.jpg",
    "lifeTrustee": false,
    "noDetail": false,
    "description": "<p>Mr. Motulsky is a managing director at Moelis & Company, a leading global independent investment bank.  Previously, Mr. Motulsky was a managing director and global head of Consumer & Retail at Lazard, a global investment bank providing financial advisory and asset management services, from 2000 to June 2014, having joined the firm in 1998. Before his service with Lazard, Mr. Motulsky was a partner at Tanner & Co., Inc., a merchant banking and mergers and acquisition advisory firm. Before that, he served as an investment banker at Salomon Brothers Inc.</p><p>Mr. Motulsky serves on the Board of Directors of The Bon-Ton Stores, Inc., a publicly listed retailer with sales of $3 billion, and is a member of the Council on Foreign Relations. He formerly served on the Board of Directors of Mega Brands Inc.</p>",
    "link": ""
  },
  {
    "name": "Robert H. Mundheim",
    "lastName": "Mundheim",
    "title": "Of Counsel,<br>Shearman & Sterling, LLP",
    "position": "",
    "image": "/edu-assets/leadership/img/Mundheim-Robert.jpg",
    "lifeTrustee": false,
    "noDetail": false,
    "description": "<p>Mr. Mundheim is of counsel at the global law firm Shearman & Sterling LLP, where he advises on corporate governance and professional responsibility issues. He is also a professor of corporate law and finance at the University of Arizona Law School. He has been University Professor of Law and Finance at the University of Pennsylvania and dean of its law school. Mr. Mundheim has been the general counsel of the U.S. Treasury, executive vice president and general counsel of Salomon Inc., president of the American Academy in Berlin, president of the Appleseed Foundation, and chair of the American Bar Association’s Standing Committee on Ethics and Professional Responsibility. He is also a trustee of the Curtis Institute of Music, a director of the Salzburg Global Seminar, a founding trustee of the American College of Governance Counsel, and a council member (emeritus) of the American Law Institute.</p>",
    "link": ""
  },
  {
    "name": "Charles R. Perrin",
    "lastName": "Perrin",
    "title": "Former Chairman and CEO, Avon Products, Inc. and Duracell",
    "position": "",
    "image": "/edu-assets/leadership/img/Perrin-Charlie.jpg",
    "lifeTrustee": false,
    "noDetail": false,
    "description": "<p>Mr. Perrin is the former non-executive chairman of the board of The Warnaco Group, former chairman and CEO of Avon Products, and former chairman and CEO of Duracell International, Inc. He is currently a member of the boards of Abercrombie & Fitch Co. and the Campbell Soup Co.</p><p>Mr. Perrin formerly served as chair of Save the Children International and is currently a trustee of Save the Children U.S.  He is the co-founder and a trustee of the Perrin Family Foundation. He is also the former chairman and vice chairman of Ability Beyond Disability and a former trustee of Trinity College</p><p>Mr. Perrin was introduced to The New School by board chair Joseph Gromek.</p>",
    "link": ""
  },
  {
    "name": "Josh Sapan",
    "lastName": "Sapan",
    "title": "President and CEO, AMC Networks Inc.",
    "position": "",
    "image": "/edu-assets/leadership/img/josh-sapan.jpg",
    "lifeTrustee": false,
    "noDetail": false,
    "description": "<p>One of the entertainment industry&rsquo;s most innovative and visionary executives, Josh Sapan is the president and CEO of AMC Networks, which includes the entertainment brands AMC, BBC America, IFC, SundanceTV, WE tv, and IFC Films; the streaming services Sundance Now, Shudder, Acorn TV, and Urban Movie Channel (UMC); AMC Studios; and AMC Networks International. He was named CEO in 1995.</p><p>Under Mr. Sapan&rsquo;s leadership, AMC Networks has become known for its groundbreaking programming.  The company is responsible for award-winning, culturally significant hits including <em>Killing Eve</em>, <em>Better Call Saul</em>, <em>The Walking Dead</em>, <em>Portlandia</em>, <em>Rectify</em>, <em>Top of the Lake</em>, <em>Breaking Bad</em>, <em>Mad Men</em>, and many more.</p><p>Mr. Sapan has been a pioneer in bringing independent film to wide audiences through the award-winning film distribution labels IFC Films, Sundance Selects, and IFC Midnight, which have distributed hundreds of films, including the Oscar- and Golden Globe Award–winning <em>Boyhood</em>, the critically acclaimed <em>The Death of Stalin</em>, and the Oscar-nominated <em>45 Years</em>, to name just a few. In 2005, Mr. Sapan opened the IFC Center in New York City&rsquo;s Greenwich Village, home to DOC NYC, the largest documentary film festival in the United States.</p><p>Mr. Sapan currently serves on the boards of the American Film Institute, the Paley Center for Media, the Museum of the Moving Image, and NCTA – The Internet &amp; Television Association. He is also a member of the Executive Branch of the Academy of Motion Picture Arts and Sciences (AMPAS) and of New York Public Radio.</p>",
    "link": ""
  },
  {
    "name": "Elliot Stein",
    "lastName": "Stein",
    "title": "Managing Director, Commonwealth Capital Partners, L.P.",
    "position": "Vice Chair",
    "image": "/edu-assets/leadership/img/Stein-Skip.jpg",
    "lifeTrustee": false,
    "noDetail": false,
    "description": "<p>Mr. Stein is chairman of Acertas LLC and Senturion Forecasting LLC and a Managing Director of Commonwealth Capital Partners. He is a member of the boards of directors of several public companies and is also a trustee of Claremont Graduate University. He is a member of the Council on Foreign Relations. Mr. Stein’s personal and professional interests in politics, communications, the arts, and education have served him well as a New School trustee.</p>",
    "link": ""
  },
  {
    "name": "Kay Unger<br>Fashion Design '68",
    "lastName": "Unger",
    "title": "CEO, Kay Unger Family Foundation",
    "position": "",
    "image": "/edu-assets/leadership/img/Unger-Kay.jpg",
    "lifeTrustee": false,
    "noDetail": false,
    "description": "<p>Fashion designer, entrepreneur and philanthropist, Ms. Unger began her multifaceted career in 1968 as design assistant to Geoffrey Beene. Two years later, she founded her own dress firm, Kay Unger — the first of several successful global fashion concerns she founded and managed, including The Gillian Group, Kay Unger New York, Kay J’s Pajamas, and Phoebe Couture. In 2012, she formed Kay Unger Design as a means of focusing her boundless energy on unique design projects that benefit from her creative and leadership skills.</p><p>A committed philanthropist, Kay is CEO of the Kay Unger Family Foundation (KUFF), with its mission of “venture philanthropy.” KUFF supports existing foundations for cancer care and research and also provides funding for scholarships to underserved youths who are talented in the arts.</p><p>Born and raised in Chicago, Kay has lived in New York throughout her career; she currently lives in SoHo. She has two sons and five grandchildren</p>",
    "link": "http://www.kayungerdesign.com"
  },
  {
    "name": "Lilian Shiao-Yen Wu",
    "lastName": "Wu",
    "title": "Program Executive, IBM Global University Programs,<br>IBM Corporation",
    "position": "",
    "image": "/edu-assets/leadership/img/Wu-Lilian.jpg",
    "lifeTrustee": false,
    "noDetail": false,
    "description": "<p>Dr. Wu is a research scientist and a program executive for IBM Global University Programs. She serves as a member of the Board of Trustees of the KECK Graduate Institute for Applied Life Sciences (one of the Claremont Colleges). In addition, she serves on the Advisory Committee for the National Science Foundation’s Directorate for Education and Human Resources and on the board of the Muscular Dystrophy Association and Public Agenda, both nonprofit organizations.</p>",
    "link": "http://www.ibm.com/en-us/homepage-c.html"
  },
  {
    "name": "William D. Zabel",
    "lastName": "Zabel",
    "title": "Partner,<br>Schulte Roth & Zabel, LLP",
    "position": "",
    "image": "/edu-assets/leadership/img/Zabel-Bill.jpg",
    "lifeTrustee": false,
    "noDetail": false,
    "description": "<p>Mr. Zabel is a founding partner of Schulte Roth & Zabel LLP and head of the Individual Client Services Group. He practices in the areas of estate planning, wills, trusts, charitable foundations, income and gift tax planning, estate administration, and family law. He serves as chair of Human Rights First and Immigration Justice Corps and on the boards of Lincoln Center Theater and The Academy of American Poets, among other civic memberships. Mr. Zabel is keenly interested in the forces driving the worldwide movement toward democracy, an issue reflecting core values of The New School.</p>",
    "link": "http://www.srz.com/"
  }
]